datas = [];

datas[0] = {
  time: "1학기",
  type: "서양사 문제(준비중)",
  d: [
    {
      title: "준비중",
      ex: "누가 준비 중이라 쓰여 있는데 누르라 그랬어요 ^^",
    },
  ],
};

datas[1] = {
  time: "1학기",
  type: "동양사 문제",
  d: [
    {
      title: "인더스",
      ex: "기원전 2500년경 인도의 [ ]강 유역에서 계획도시가 생겨나 도시 문명이 일어났다.",
    },
    {
      title: "아리아",
      ex: "기원전 1500년경 중앙아시아에서 유목 생활을 하던 [ ]인이 인더스강 유역으로 이동하였다.\n기원전 1000년경에는 갠지스강 유역까지 진출하였고, 철제 기술을 사용하였다.",
    },
    {
      title: "카스트제",
      ex: "아리아인은 원주민을 지배하기 위해 [ ](이)라는 신분제를 만들었다.",
    },
    {
      title: "베다",
      ex: "아리아인은 자연 현상을 다스리는 신에게 제사를 지냈고, 신을 찬양하는 경전인 [ ]을(를) 완성하였다.",
    },
    {
      title: "브라만",
      ex: "아리아인은 [ ]교를 성립하였고, 지배 계급인 [ ]은(는) 종교적 권위를 통해 특권을 누렸다.",
    },
    {
      title: "황허",
      ex: "[ ]강 유역은 일찍이 농경이 발달하였고, 기원전 2500년경 [ ]강 유역을 중심으로 청동기와 문자를 사용한 초기 국가가 나타났다.",
    },
    {
      title: "상",
      ex: "기원전 1600년경 황허강 중류 지역에서 [ ]이(가) 세워졌다.\n[ ]에서는 청동으로 무기와 제사용 도구를 만들고, 석기와 나무로 농기구를 제작하였다.",
    },
    {
      title: "태음력",
      ex: "상에서는 해와 달의 움직임을 관찰하여 [ ]을(를) 만들었다.",
    },
    {
      title: "갑골 문자",
      ex: "상의 왕은 나라에 중요한 일이 있을 때 점을 쳐서 결정한 뒤\n결과를 거북의 배딱지 등에 기록하였는데 이를 [ ]라고 한다.",
    },
    {
      title: "주",
      ex: "상의 서쪽에서 일어난 [ ]은(는) 기원전 11세기경 상을 무너뜨리고 황허강 유역을 차지하였다.",
    },
    {
      title: "봉건제",
      ex: "주는 넓어진 영토를 효과적으로 다스리기 위해 수도 부근을 제외한 나머지 지역을\n왕족이나 공신을 제후로 삼아 이들에게 나누어 다스리게 하는 [ ]을(를) 실시하였다.",
    },
    {
      title: "낙읍",
      ex: "기원전 8세기경 서북쪽의 유목 민족이 침입해 오자 주는 수도를 [ ](으)로 옮겼다.\n그 뒤 제후들이 서로 세력을 다투며 사회는 혼란에 빠졌다.",
    },
    {
      title: "춘추 전국 시대",
      ex: "주 왕실의 권위가 약해지고 제후들이 제각기 독립하여 [ ]이(가) 시작되었다.",
    },
    {
      title: "철기",
      ex: "천추 전국 시대에 상업과 수공업이 발달하여 도시와 시장이 성장하였으며, [ ] 무기가 사용되면서 전쟁의 규모가 커졌다.",
    },
    {
      title: "제자백가",
      ex: "춘추 전국 시대에 각국이 경쟁에서 살아남기 위해 유능한 인재를 등용하여 부국강병을 추진하였는데,\n이 과정에서 [ ]이(가) 나타났다.",
    },
    {
      title: "유가",
      ex: "공자와 맹자는 '인'과 '예'를 중심으로 한 도덕 정치를 강조하여 [ ] 사상을 발전시켰다.\n후에 한 무제가 통치 이념으로 정하였다.",
    },
    {
      title: "묵가",
      ex: "묵자는 혈연과 신분을 뛰어넘는 차별 없는 사랑을 강조하여 [ ] 사상을 만들었다.",
    },
    {
      title: "법가",
      ex: "한비자가 완성한 [ ] 사상은 법과 제도를 엄격히 적용하여 백성을 통제해야 한다고 주장하였다.\n후에 진 시황제가 통치 이념으로 정하였다.",
    },
    {
      title: "도가",
      ex: "노자와 장자에서 비롯된 [ ]은(는) 자연의 순리에 따르는 삶을 추구하였다.",
    },
    {
      title: "진",
      ex: "[ ]은(는) 법가 사상을 토대로 부국강병을 이루어 500년 동안 혼란스러웠던 중국을 기원전 221년 최초로 통일하였다.",
    },
    {
      title: "시황제",
      ex: "중국을 통일한 진왕은 자신의 권위를 높이기 위해 왕의 칭호를 황제로 바꾸고,\n스스로를 첫 번째 황제라는 뜻의 [ ](으)로 칭하였다.",
    },
    {
      title: "군현제",
      ex: "시황제는 전국을 군과 현으로 나누고 각 군, 현에 직접 관리를 보내 다스리는 [ ]을(를) 실시하였다.\n[ ]은(는) 한 무제가 다시 전국적으로 실시하였다.",
    },
    {
      title: "도로망",
      ex: "시황제는 수도에서 전국으로 뻗어 나가는 [ ]을(를) 정비하여\n황제의 명령이 지방에 빠르게 전달될 수 있게 하였다.",
    },
    {
      title: "문자",
      ex: "시황제는 지역마다 달랐던 화폐, 도량형, [ ] 등을 통일하였다.",
    },
    {
      title: "분서갱유",
      ex: "시황제는 법가 사상을 채택하여, 법가 사상 서적과 실용 서적을 제외한 모든 책을 불태우고,\n이를 비판하는 유학자들을 생매장한 [ ] 사건을 일으켰다.",
    },
    {
      title: "만리장성",
      ex: "시황제는 북방 유목 민족인 흉노의 침입을 막기 위해 북쪽 국경에 [ ]을(를) 쌓았다.",
    },
    {
      title: "대규모 토목 공사",
      ex: "진은 만리장성 등 [ ]에 백성을 자주 동원하고, 백성을 가혹하게 통치하여 불만을 샀기 때문에,\n진은 중국을 통일한 지 15년 만에 멸망하였다.",
    },
    {
      title: "한",
      ex: "진이 멸망한 후 [ ]의 유방(고조)이 초의 항우를 물리치고 기원전 202년 중국을 다시 통일하였다.",
    },
    {
      title: "군국제",
      ex: "한 고조는 봉건제와 군현제를 절충한 [ ]을(를) 전국적으로 시행하였다.",
    },
    { title: "무제", ex: "한 [ ]은(는) 흉노를 정벌하고 고조선을 정복하였다." },
    {
      title: "전매 제도",
      ex: "한 무제는 부족해진 재정을 해결하기 위해 소금과 철을 독점 판매하는 [ ]을(를) 실시하였다.",
    },
    {
      title: "후한",
      ex: "한과 신의 멸망 이후 유수(광무제)가 다시 한을 세웠는데, 이를 [ ](이)라 한다.",
    },
    {
      title: "호족",
      ex: "한대에는 대토지를 소유한 [ ]들이 지방에서 농민을 지배하였고, 중앙 관리로도 진출하여 정치를 주도하였다.",
    },
    {
      title: "황건적의 난",
      ex: "후한 말 외척과 환관의 횡포가 심해지고 사회가 혼란해지자 각지에서 [ ]을(를) 비롯한 농민 반란이 일어났다.\n이러한 혼란을 틈타 호족이 각지에서 봉기하면서 후한은 220년 멸망하였다.",
    },
    {
      title: "훈고학",
      ex: "한대에는 유교 경전을 정리하고 연구하는 학문인 [ ]이(가) 발달하였다.\n이후 당 시대에 [ ]을(를) 집대성한 '오경정의'가 편찬되었다.",
    },
    {
      title: "사기",
      ex: "사마천이 편찬한 역사책인 [ ]은(는) 이후 중국 역사 서술의 모범이 되었다.",
    },
    {
      title: "제지술",
      ex: "후한의 환관 채륜은 오랫동안 실험을 거듭한 끝에 종이 만드는 법을 [ ]을(를) 개량하였다.",
    },
    {
      title: "비단길",
      ex: "한 무제는 대월지와 손잡고 흉노를 공격하기 위해 장건을 서역에 파견하였다.\n비록 군사 동맹은 이루어지지 않았지만 이후 한은 동서 교역로인 [ ]을(를) 열었다.",
    },
    {
      title: "진(晉)",
      ex: "3세기 초 후한이 멸망한 뒤 중국은 위, 촉, 오의 세 나라로 분열되었다.\n위를 이은 [ ]이(가) 삼국을 통일하였으나 혼란이 지속되었다.",
    },
    {
      title: "북위",
      ex: "진(晉) 멸망 이후 화북 지방을 선비족이 세운 [ ]이(가) 통일하였다.",
    },
    {
      title: "한화 정책",
      ex: "북위의 효문제는 한족의 언어와 의복을 사용하고, 선비족의 성씨를 한족의 성씨로 바꾸도록 하는 등 [ ]을(를) 실시하였다.",
    },
    {
      title: "창장강",
      ex: "진(晉) 멸망 이후 [ ] 이남에서는 한족이 동진과 동진의 뒤를 뒤은 한족 국가들이 세워졌다.",
    },
    {
      title: "위진 남북조 시대",
      ex: "한이 멸망한 이후부터 수가 중국을 통일할 때까지의 시기를 [ ](이)라고 한다.",
    },
    {
      title: "9품중정제",
      ex: "위진 남북조 시대에는 추천으로 관리를 선발하는 [ ]이(가) 실시되었다.\n그 결과 호족 가문이 대대로 관직을 독차지하면서 문벌 귀족으로 성장하였다.",
    },
    {
      title: "도교",
      ex: "위진 남북조 시대에 도가 사상과 민간 신앙이 결합하여 [ ]로 발전하였다.",
    },
    {
      title: "청담 사상",
      ex: "남조에서는 개인의 자유로운 삶을 추구하는 [ ]와(과) 화려한 귀족 문화가 발전하였다.",
    },
    {
      title: "수",
      ex: "[ ]은(는) 350년 이상 북조와 남조로 분열되어 있던 중국을 589년 다시 통일하였다.",
    },
    {
      title: "과거제",
      ex: "수를 건국한 문제는 시험을 통해 관리를 선발하는 [ ]을(를) 실시하여 문벌 귀족의 관직 독점을방지하고 왕권을 강화하고자 하였다.",
    },
    {
      title: "대운하",
      ex: "수 양제는 화북 지방과 강남 지방을 연결하는 [ ]을(를) 건설하였다.\n[ ]은(는) 물자 유통을 원활하게 하여 남북 간의 교류를 촉진하였다.",
    },
    {
      title: "당",
      ex: "수 멸망 이후 혼란을 수습한 이연(고조)은 장안을 수도로 삼아 618년 [ ]을(를) 건국하였다.",
    },
    {
      title: "율령",
      ex: "당 태종은 수의 제도를 이어받아 [ ] 체제를 완성하였다. [ ] 체제는 이후 동아시아 문화권에서 공유되었다.",
    },
    {
      title: "3성 6부",
      ex: "당은 통치 제도를 정비하여 중앙에 국가 행정 기관인 [ ]을(를) 운영하고,\n지방에 주와 현을 두어 관리를 파견하였다.",
    },
    {
      title: "균전제",
      ex: "당은 성인 남성 농민들에게 일정한 토지를 나누어 주는 제도인 [ ]을(를) 실시하였다.",
    },
    {
      title: "조용조",
      ex: "당은 농민들에게 곡물, 노동력, 직물인 [ ]의 세금을 거두었다.",
    },
    {
      title: "부병제",
      ex: "당은 농민을 병사로 복무시키는 [ ]을(를) 실시하였다.",
    },
    {
      title: "안사의 난",
      ex: "당 현종 시기 지방의 절도사였던 안녹산과 부하인 사사명이 [ ](이)라고 불리는 반란을 일으켰다.",
    },
    {
      title: "절도사",
      ex: "[ ]은(는) 당 시대에 변방 지역을 지키기 위해 마련한 직책으로,\n안사의 난 이후 주둔 지역의 모든 분야을 장악하였다.",
    },
    {
      title: "당삼채",
      ex: "[ ]은(는) 당대에 제작된 대표적인 도자기로,\n백색, 갈색, 녹색 3가지 색채의 유약을 사용하여 구웠다.",
    },
    {
      title: "현장",
      ex: "당대에 [ ] 등의 승려들이 서역과 인도를 순례하고 불교 경전으 들여왔으며\n그들이 여행기를 남기기도 하였다.",
    },
    { title: "골계미", ex: "익살을 부리는 가운데 느껴지는 아름다운" },
    {
      title: "동아시아 문화권",
      ex: "당과 지리적으로 가까운 지역에는 당의 선진 문화를 수용하여,\n한자, 율령, 유교, 불교 등의 문화 요소를 공유하는 [ ]이(가) 형성되었다.",
    },
    {
      title: "송",
      ex: "당 멸망 이후 중국은 절도사들이 세운 여러 나라로 분열하였는데,\n이러한 상황에서 조광윤(태조)이 960년 [ ]을(를) 건국하였다.",
    },
    {
      title: "문치주의",
      ex: "송의 태조는 절도사 세력을 약화하고 문인 관료를 우대하는 [ ]을(를) 실시하였다.",
    },
    {
      title: "사대부",
      ex: "송대에는 문치주의를 실시하여 유교적 소양을 갖춘 [ ] 계층이 형성되었다.\n이들은 과거를 통해 문인 관료로 선발되어 새로운 지배층으로 떠올랐다.",
    },
    {
      title: "왕안석",
      ex: "송은 지나친 문치주의로 군사력이 약해져 북방 민족과 평화를 유지하기 위해 많은 공물을 보내 재정이 어려워지자,\n[ ]은(는) 민생 안정과 부국강병을 목표로 개혁을 시도하였으나 보수파 관료들의 반대로 실패하였다.",
    },
    {
      title: "남송",
      ex: "송은 금의 공격을 받아 남쪽으로 수도를 옮겼는데, 이 시기를 [ ](이)라고 한다.\n[ ]은(는) 비옥한 강남 지역을 개발하여 경제적인 번영을 누렸으나 원의 침략으로 1279년 멸망하였다.",
    },
    {
      title: "행, 작",
      ex: "송대의 도시의 상인과 수공업자들은 [ ] 등의 동업 조합을 만들어 자신들의 이익을 보호하고자 하였다.",
    },
    {
      title: "교자",
      ex: "송대에는 상거래가 많아지면서 동전이 널리 유통되었고 [ ](이)라는 지폐도 만들어졌다.",
    },
    {
      title: "성리학",
      ex: "남송의 주희는 우주의 원리와 인간의 본성을 탐구하는 [ ]을(를) 완성하였다.\n[ ]은(는) 이후 중국을 비롯한 동아시아 각국의 통치 이념이 되었다.",
    },
    {
      title: "화약 무기",
      ex: "송대에는 과학 기술이 발달하여 [ ], 나침반, 활판 인쇄술 등이 발명되었고 이들은 이후 원대에 세계 여러 지역에 전파되었다.",
    },
    {
      title: "서민 문화",
      ex: "송과 원 시대에는 귀족 문화가 아닌 [ ]이(가) 발달하였다.",
    },
    {
      title: "시박사",
      ex: "송대에는 최안저우, 광저우 등의 항구에 무역 사무를 맡아보던 [ ]을(를) 두어 대외 무역을 관리하였다.",
    },
    {
      title: "북방 민족",
      ex: "중국 위에 살던 [ ]인 거란족, 탕구트족, 여진족은 각각 요, 서하, 금이라는 정복 국가를 세워 중국을 압박하였다.",
    },
    {
      title: "칭기즈 칸",
      ex: "13세기 초 테무친은 몽골 부족을 통일한 후 [ ](으)로 추대되어 몽골 제국을 세웠다.",
    },
    {
      title: "원",
      ex: "왕위 계승 다툼에서 승리한 쿠빌라이 칸은 1271년 수도를 대도(베이징)으로 옮기고 나라 이름을 [ ](으)로 바꾸었다.",
    },
    {
      title: "몽골 제일주의",
      ex: "원은 [ ]을(를) 내세워 몽골인과 색목인을 우대하였고, 한인과 남인은 피지배 계층을 이루었다.",
    },
    {
      title: "파스파 문자",
      ex: "원은 전통문화를 지키기 위해 고유의 문자인 [ ]을(를) 만들어 공식 문서에 사용하였다.",
    },
    {
      title: "역참",
      ex: "몽골 제국은 중앙과 지방을 연결하는 교통로에 [ ]을(를) 세우고,\n관리나 사신에게 숙식과 말을 제공하는 [ ]제를 실시하였다.",
    },
    {
      title: "초원길",
      ex: "몽골 제국 당시 [ ], 비단길, 바닷길이 연결되어 유라시아 대륙이 하나의 교역권으로 통합되었고,\n동서 문화 교류가 더욱 활기를 띠었다.",
    },
    {
      title: "동방견문록",
      ex: "이탈리아 상인 마르코 폴로는 중국을 다녀간 후 [ ]을(를) 남겼다.",
    },
    {
      title: "수시력",
      ex: "원의 곽수격은 이슬람의 역법, 천문학을 토대로 [ ](이)라 불리는 달력을 만들었다.",
    },
  ],
};

/*
url quers의 id가
0 -> datas[0] == 1학기 중간고사 국어 어휘
1 -> datas[1] == 1학기 중간고사 국어 한자 성어

추가 예정
2 -> datas[2] == 1학기 기말고사 국어 어휘
3 -> datas[3] == 1학기 기말고사 국어 한자 성어
*/

function get_quers() {
  urls = location.search.split("&");
  quers = {};

  for (var i = 0; i < urls.length; i++) {
    url_data = urls[i].split("=");
    if (i == 0) {
      quers[url_data[0].slice(1)] = url_data[1];
    } else {
      quers[url_data[0]] = url_data[1];
    }
    // console.log(urls[i])
  }
  return quers;

  // real = data[quers["id"]]

  // for(var i = 0; i < real.length; i++){
  //     console.log(real[i])
  // }
}

id = Number(get_quers()["id"]);

function checkOutside(id) {
  if (window.location.href.indexOf("index.html") === -1) {
    if (isNaN(id) || id < 0 || id > datas.length) {
      location.href = "/index.html";
    }
  }
}
