datas = []

datas[0] = {"time" : "1학기 중간고사",  "type": "어휘","d" : [{'title': '가변성', 'ex': '일정한 조건에서 변할 수 있는 성질.'},
{'title': '가설', 'ex': '실험에 의해 확정된 사실을 설명하기 위하여 설정한 저정적인 학설'},
{'title': '가식', 'ex': '말이나 행동 따위를 거짓으로 꾸밈.'},
{'title': '가정', 'ex': '사실이 아니거나 또는 사실인지 아닌지 분명하지 않은 것을 임시로 인정함.'},
{'title': '간과', 'ex': '큰 관심 없이 대강 보아 넘김.'},
{'title': '간접적', 'ex': '중간에 매개가 되는 사람이나 사물 따위를 통하여 연결되는 것.'},
{'title': '간주', 'ex': '상태, 모양, 성질 따위가 그와 같다고 봄. 또는 그렇다고 여김.'},
{'title': '간파', 'ex': '속내를 꿰뚫어 알아차림.'},
{'title': '감각적 이미지', 'ex': '인간의 감각 기관으로 느낄 수 있는 표현 == 심상'},
{'title': '감성적', 'ex': '감성을 위주로 하거나 감성에 관한 것.'},
{'title': '감수성', 'ex': '외부 세계의 자극을 받아들이고 느끼는 성질.'},
{'title': '감안', 'ex': '여러 사정을 참고하여 생각함.'},
{'title': '감정이입', 'ex': '시적 화자의 감정이 어떤 사물에 같은 감정으로 나타나 있는 것'},
{'title': '감정적', 'ex': '마음이나 기분에 의한 것.'},
{'title': '감지', 'ex': '느끼어 앎.'},
{'title': '감화', 'ex': '좋은 영향을 받아 생각이나 감정이 바람직하게 변화함. 또는 그렇게 변하게 함.'},
{'title': '감흥', 'ex': '마음속 깊이 감동받아 일어나는 흥취.'},
{'title': '강구', 'ex': '좋은 대책과 방법을 궁리하여 찾아내거나 좋은 대책을 세움.'},
{'title': '강호가도', 'ex': '조선 시대에, 은자(隱者)나 시인(詩人), 묵객(墨客) 들이 현실을 도피하여 자연을 벗 삼아 지내면서 일으킨 시가 창작의 한 경향.'},
{'title': '강화', 'ex': '세력이나 힘을 더 강하고 튼튼하게 함.'},
{'title': '개괄', 'ex': '중요한 내용이나 줄거리를 대강 추려 냄.'},
{'title': '개념적', 'ex': '대상을 직관(直觀)이나 표상(表象)에 의해서가 아니라 개념에 의하여 파악하는 것.'},
{'title': '개방적', 'ex': '태도나 생각 따위가 거리낌 없고 열려 있는 것.'},
{'title': '개별성', 'ex': '사물이나 사람 또는 어떤 상황이나 현상이 각각 따로 지니고 있는 특성.'},
{'title': '개연성', 'ex': '어떤 현상이 발생할만한 것. 실제로 일어날 법한 인생의 문제를 다루는 문학적 성격'},
{'title': '객관적', 'ex': '자기와의 관계에서 벗어나 제삼자의 입장에서 사물을 보거나 생각하는 것.'},
{'title': '객관적 상관물', 'ex': '시적 화자의 감정을 환기하기 위하여 사용되는 사물'},
{'title': '객관화', 'ex': '자기에게 직접 관련되는 사항을 제삼자의 입장에서 보거나 생각하는 일.'},
{'title': '거시적', 'ex': '사람의 감각으로 식별할 수 있을 정도의 것.'},
{'title': '검증', 'ex': '어떤 명제의 참, 거짓을 사실에 비추어 검사하는 일'},
{'title': '격동', 'ex': '정세 따위가 급격하게 움직임.'},
{'title': '격앙', 'ex': '기운이나 감정 따위가 격렬히 일어나 높아짐.'},
{'title': '격정', 'ex': '강렬하고 갑작스러워 누르기 어려운 감정.'},
{'title': '견지', 'ex': '어떤 견해나 입장 따위를 굳게 지니거나 지킴.'},
{'title': '결부', 'ex': '일정한 사물이나 현상을 서로 연관시킴.'},
{'title': '겸양', 'ex': '겸손한 태도로 남에게 양보하거나 사양함.'},
{'title': '경각심', 'ex': '정신을 차리고 주의 깊게 살피어 경계하는 마음.'},
{'title': '경건하다', 'ex': '공경하며 삼가고 엄숙하다.'},
{'title': '경계', 'ex': '뜻밖의 사고가 생기지 않도록 조심하여 단속함. '},
{'title': '경과', 'ex': '시간이 지나감.'},
{'title': '경륜', 'ex': '일정한 포부를 가지고 일을 조직적으로 계획함. 또는 그 계획이나 포부.'},
{'title': '경세적', 'ex': '세상사람들을 가르쳐 꺄우치려고 하는, 또는 그런 것'},
{'title': '경시', 'ex': '대수롭지 않게 보거나 업신여김.'},
{'title': '경지', 'ex': '일정한 경계 안의 땅'},
{'title': '경험적', 'ex': '경험에 기초한 것. 또는 관찰이나 실험에서 도출된 덧'},
{'title': '계몽', 'ex': '지식수준이 낮거나 인습에 젖은 사람을 가르쳐서 깨우침.'},
{'title': '고답적', 'ex': '속세에 초연하며 현실과 동떨어진 것을 고상하게 여기는 것.'},
{'title': '고루하다', 'ex': '낡은 관념이나 습관에 젖어 고집이 세고 새로운 것을 잘 받아들이지 아니하다.'},
{'title': '고백적', 'ex': '마음속에 생각하고 있거나 감추어 둔 것을 숨김없이 말하는 것.'},
{'title': '고사', 'ex': '유레가 있는 옛날의 일. 또는 그런일을 표현한 어구'},
{'title': '고안', 'ex': '연구하여 새로운 안을 생각해 냄. 또는 그 안.'},
{'title': '고전적', 'ex': '옛날의 의식이나 법식을 따르는 것.'},
{'title': '고조', 'ex': '사상이나 감정, 세력 따위가 한창 무르익거나 높아짐'},
{'title': '고증', 'ex': '예전에 있던 사물들의 시대, 가치, 내용 따위를 옛 문헌이나 물건에 기초하여 증거를 세워 이론적으로 밝힘.'},
{'title': '고착', 'ex': '물건 같은 것이 굳게 들러붙어 있음.'},
{'title': '고찰', 'ex': '어떤 것을 깊이 생각하고 연구함.'},
{'title': '고취', 'ex': '북을 치고 피리를 붊.'},
{'title': '고풍', 'ex': '예스러운 풍치나 모습'},
{'title': '골계미', 'ex': '익살을 부리는 가운데 느껴지는 아름다운'},
{'title': '공감각적 심상', 'ex': '한 종류의 감각을 다른 감각으로 옮겨서 표현한 것'},
{'title': '공감적', 'ex': '남의 감정, 의견, 주장 따위에 대하여 자기도 그렇다고 느끼는, 또는 그런것'},
{'title': '공고히', 'ex': '단단하고 튼튼하게.'},
{'title': '공동체적', 'ex': '생활이나 행동 또는 목적 따위를 같이하는, 도는 그런 것'},
{'title': '공상적', 'ex': '현실적이지 못하거나 실현될 가망이 없는 것을 막연히 그리어 보는 것.'},
{'title': '공시적', 'ex': '대상을 같은 시간대에 존재하는 양상으로 파악하는 것'},
{'title': '과도적', 'ex': '한 단계에서 다른 단계로 옮아가는 것.'},
{'title': '관건', 'ex': '어떤 사물이나 문제 해결의 가장 중요한 부분'},
{'title': '관념', 'ex': '어떤 일에 대한 견해나 생각.'},
{'title': '관념적', 'ex': '현실에 동떯어진 추상적인 생각에만 사로잡혀 사는 것'},
{'title': '관습', 'ex': '어떤 사회에서 오랫동안 지켜 내려와 그 사회 성원들이 널리 인정하는 질서나 풍습.'},
{'title': '관습적 표현', 'ex': '습관처럼 쓰이는 표현, 속담이나 한자성어 같은 관용어구, 고사, 관습적인 상징의 활용 등으로 나타남'},
{'title': '관점', 'ex': '사물을 보거나 생각하는 방법이나 입장'},
{'title': '관조적', 'ex': '고요한 마음으로 사물이나 현상을 관찰하거나 비추어 보는 것.'},
{'title': '괴리', 'ex': '서로 조화나 일치를 이루지 못하고 어그러져 동떯어짐'},
{'title': '교감', 'ex': '서로 접촉하여 따라 움직이는 느낌.'},
{'title': '교섭', 'ex': '어떤 일을 이루기 위하여 서로 의논하고 절충함.'},
{'title': '교술', 'ex': '대상이나 세계를 객관적으로 묘사하고 설명하는 장르.'},
{'title': '교조적',
 'ex': '역사적 환경이나 구체적 현실과 관계없이 어떠한 상황에서도 절대로 변하지 않는 진리인 듯 믿고 따르는 것.'},
{'title': '교차', 'ex': '서로 엇갈리거나 마주침.'},
{'title': '교화적', 'ex': '가르치고 이끌어서 좋은 방향으로 나아가게 하는 것.'},
// {'title': '교차', 'ex': '서로 엇갈리거나 마주침.'},
// {'title': '교화적', 'ex': '가르치고 이끌어서 좋은 방향으로 나아가게 하는 것.'},
{'title': '교훈적',
 'ex': '교훈이 되거나 교훈으로 삼을 만한 것. 세상 사람들에게 선과 악, 진실과 거짓 등을 일 깨우는 것'},
{'title': '구사하다', 'ex': '말이나 수사법, 기교, 수단 따위를 능숙하게 마음대로 부려 쓰다.'},
{'title': '구상',
 'ex': '앞으로 이루려는 일에 대하여 그 일의 내용이나 규모, 실현 방법 따위를 어떻게 정할 것인지 이리저리 생각함. 또는 그 생각.'},
{'title': '구상화',
 'ex': '구상적인 것(사물, 특히 예술 작품 따위가 직접 경험하거나 지각훌 수 있도록 일정한 형태와 성질을 갖추고 있는 것)으로 되거나 되게 함.'},
{'title': '구애', 'ex': '거리끼거나 얽매임.'},
{'title': '구체적', 'ex': '사물이 직접 경험하거나 지각할 수 있도록 일정한 형태와 성질을 갖추고 있는 것.'},
{'title': '구체화', 'ex': '구체적인 것이 됨, 또는 그렇게 만듦'},
{'title': '구축', 'ex': '어떤 시설물을 쌓아 올려 만듦'},
{'title': '구현', 'ex': '어떤 내용이 구체적인 사실로 나타나게 함.'},
{'title': '국수적', 'ex': '자기 나라의 것을 최고로 생각하고 다른 나라의나 민족의 것은 배척하는. 또는 그런 것'},
{'title': '궁극적', 'ex': '더할 나위 없는 지경에 도달하는 것. 최종적인 것.'},
{'title': '권위적',
 'ex': '권위(남을 지휘하거나 통솔하여 따르게 하는 힘, 일정한 분야에서 사회적으로 인정을 받고 영향력을 끼칠 수 있는 위신.)를 내세우는 것.'},
{'title': '귀납',
 'ex': '개별적인 특수한 사실이나 원리로부터 일반적이고 보편적인 명제 및 법칙을 유도해 내는 일. 추리 및 사고방식의 하나로, 개연적인 확실성만을 가진다.'},
{'title': '귀착', 'ex': '다른 곳에서 어떤 곳으로 돌아오거나 돌아가 닿음.'},
{'title': '규범적', 'ex': '마땅히 따르고 지켜야 할 본보기가 되는 것.'},
{'title': '규합', 'ex': '어떤 일을 꾸미려고 세력이나 사람을 모음.'},
{'title': '극적 긴장감', 'ex': '인물 간의 갈등 또는 위기 상황이 심화되어 사건의 긴장감을 느낄 수 있는 것'},
{'title': '극적', 'ex': '극의 특성을 띤 것.'},
{'title': '극한', 'ex': '궁극의 한계. 사물이 진행하여 도달할 수 있는 최후의 단계나 지점을 이른다.'},
{'title': '근경', 'ex': '가까이 보이는 경치. 또는 가까운 데서 보는 경치.'},
{'title': '근본적', 'ex': '근본을 이루거나 근본이 되는 것.'},
{'title': '근시안', 'ex': '눈앞의 일에만 사로잡혀 먼 앞날의 일을 짐작하거나 사물 전체를 보는 지혜가 없음을 비유적으로 이르는 말'},
{'title': '급박', 'ex': '사태가 조금도 여유가 없이 매우 급함.'},
{'title': '기개', 'ex': '씩씩한 기상과 굳은 절개.'},
{'title': '기능적', 'ex': '하는 구실이나 작용과 관련된 것.'},
{'title': '기술', 'ex': '대상이나 과정의 내용과 특징을 있는 그대로 열거하거나 기록하여 서술함. 또는 그런 기록.'},
{'title': '기승전결', 'ex': "'시작-전개-전환-끝맺음'의 흐름으로 구성하는 방법"},
{'title': '기이하다', 'ex': '기묘하고 이상하다.'},
{'title': '기호', 'ex': '즐기고 좋아함.'},
{'title': '긴밀하다', 'ex': '서로의 관계가 매우 가까워 빈틈이 없다.'}]}



datas[1] = {"time" : "1학기 중간고사",  "type": "한자성어", "d" : [{'title': '가렴주구', 'ex': '세금을 가혹하게 거두어들이고, 무리하게 재물을 빼앗음.'},
{'title': '각골난망', 'ex': '남에게 입은 은혜가 뼈에 새길 만큼 커서 잊히지 아니함.'},
{'title': '감언이설', 'ex': '귀가 솔깃하도록 남의 비위를 맞추거나 이로운 조건을 내세워 꾀는 말.'},
{'title': '감탄고토',
 'ex': '달면 삼키고 쓰면 뱉는다는 뜻으로, 자신의 비위에 따라서 사리의 옳고 그름을 판단함을 이르는 말.'},
{'title': '갑론을박', 'ex': '여러 사람이 서로 자신의 주장을 내세우며 상대편의 주장을 반박함.'},
{'title': '개과천선', 'ex': '지난날의 잘못이나 허물을 고쳐 올바르고 착하게 됨.'},
{'title': '경강부회', 'ex': '이치에 맞지 않는 말을 억지로 끌어 붙여 자기에게 유리하게 함.'},
{'title': '견원지간', 'ex': '개와 원숭이의 사이라는 뜻으로, 사이가 매우 나쁜 두 관계를 비유적으로 이르는 말.'},
{'title': '경거망동', 'ex': '경솔하여 생각 없이 망령되게 행동함. 또는 그런 행동.'},
{'title': '고립무원', 'ex': '고립되어 구원을 받을 데가 없음.'},
{'title': '고진감래', 'ex': '쓴 것이 다하면 단 것이 온다는 뜻으로, 고생 끝에 즐거움이 옴을 이르는 말.'},
{'title': '공평무사', 'ex': '공평하여 사사로움이 없음.'},
{'title': '과유불급',
 'ex': '정도를 지나침은 미치지 못함과 같다는 뜻으로 , 중용(中庸)이 중요함을 이르는 말. ≪논어≫의 <선진편(先進篇)>에 나오는 말이다.'},
{'title': '구우일모',
 'ex': '아홉 마리의 소 가운데 박힌 하나의 털이란 뜻으로, 매우 많은 것 가운데 극히 적은 수를 이르는 말.'},
{'title': '구중심처', 'ex': '밖으로 잘 드러나지 않는 깊숙한 곳.'},
{'title': '구중굴궐', 'ex': '겹겹이 문으로 막은 깊은 궁궐이라는 뜻으로, 임금이 있는 대궐 안을 이르는 말.'},
{'title': '근묵자흑',
 'ex': ' 먹을 가까이하는 사람은 검어진다는 뜻으로, 나쁜 사람과 가까이 지내면 나쁜 버릇에 물들기 쉬움을 비유적으로 이르는 말.'},
{'title': '금과옥조', 'ex': '금이나 옥처럼 귀중히 여겨 꼭 지켜야 할 법칙이나 규정.'},
{'title': '기사회생', 'ex': '거의 죽을 뻔하다가 도로 살아남.'},
{'title': '노심초사', 'ex': '몹시 마음을 쓰며 애를 태움.'},
{'title': '능소능대', 'ex': '모든 일에 두루 능함.'},
{'title': '다다익선',
 'ex': '많으면 많을수록 더욱 좋음. 중국 한(漢)나라의 장수 한신이 고조(高祖)와 장수의 역량에 대하여 얘기할 때, 고조는 10만 정도의 병사를 지휘할 수 있는 그릇이지만, 자신은 병사의 수가 많을수록 잘 지휘할 수 있다고 한 말에서 유래한다.'},
{'title': '단사표음',
 'ex': '대나무로 만든 밥그릇에 담은 밥과 표주박에 든 물이라는 뜻으로, 청빈하고 소박한 생활을 이르는 말.'},
{'title': '단표누황',
 'ex': '누항에서 먹는 한 그릇의 밥과 한 바가지의 물이라는 뜻으로, 선비의 청빈 한 생활을 이르는 말. ≒누항단표.'},
{'title': '누황', 'ex': '1. 좁고 지저분하며 더러운 거리. 2. 자기가 사는 거리나 동네를 겸손하게 이르는 말.'},
{'title': '당랑거칠',
 'ex': '제 역량을 생각하지 않고, 강한 상대나 되지 않을 일에 덤벼드는 무모한 행동거지를 비유적으로 이르는 말. 중국 제나라 장공(莊公)이 사냥을 나가 는데 사마귀가 앞발을 들고 수레바퀴를 멈추려 했다는 데서 유래한다. ≪장 자≫의 <인간세편(人間世篇)>에 나오는 말이다.'},
{'title': '동문서답', 'ex': '물음과는 전혀 상관없는 엉뚱한 대답.'},
{'title': '동병상련',
 'ex': '같은 병을 앓는 사람끼리 서로 가엾게 여긴다는 뜻으로, 어려운 처지에 있는 사람끼리 서로 가엾게 여김을 이르는 말. ≪오월춘추≫의 <합려내전(闔閭內傳)>에 나온다.'},
{'title': '동분서주',
 'ex': '동쪽으로 뛰고 서쪽으로 뛴다는 뜻으로, 사방으로 이리저리 몹시 바쁘게 돌아다님을 이르는 말.'},
{'title': '동상이몽',
 'ex': '같은 자리에 자면서 다른 꿈을 꾼다는 뜻으로, 겉으로는 같이 행동하면서도 속으로는 각각 딴생각을 하고 있음을 이르는 말.'},
{'title': '두분불출',
 'ex': ' 1. 집에만 있고 바깥출입을 아니함. 2. 집에서 은거하면서 관직에 나가지 아니하거나 사회의 일을 하지 아니함을 비유적으로 이르는 말.'},
{'title': '마이동풍',
 'ex': '동풍이 말의 귀를 스쳐 간다는 뜻으로, 남의 말을 귀담아듣지 아니하고 지나쳐 흘려버림을 이르는 말.'},
{'title': '막역지우', 'ex': '서로 거스름이 없는 친구라는 뜻으로, 허물이 없이 아주 친한 친구를 이르는 말.'},
{'title': '만시지탄', 'ex': '시기에 늦어 기회를 놓쳤음을 안타까워하는 탄식.'},
{'title': '망양지탄',
 'ex': '갈림길이 매우 많아 잃어버린 양을 찾을 길이 없음을 탄식한다는 뜻으로, 학문의 길이 여러 갈래여서 한 갈래의 진리도 얻기 어려움을 이르는 말.'},
{'title': '망양지탄',
 'ex': '큰 바다를 바라보며 하는 한탄이란 뜻으로, 어떤 일에 자기 자신의 힘이 미치지 못할 때에 하는 탄식을 이르는 말.'},
{'title': '맥수지탄',
 'ex': '고국의 멸망을 한탄함을 이르는 말. 기자(箕子)가 은(殷)나라가 망한 뒤에도 보리만은 잘 자라는 것을 보고 한탄하였다는 데서 유래한다.'},
{'title': '면종복배', 'ex': '겉으로는 복종하는 체하면서 내심으로는 배반함.'},
{'title': '명재경각', 'ex': '거의 죽게 되어 곧 숨이 끊어질 지경에 이름.'},
{'title': '목불인견', 'ex': '눈앞에 벌어진 상황 따위를 눈 뜨고는 차마 볼 수 없음.'},
{'title': '반신반의', 'ex': '얼마쯤 믿으면서도 한편으로는 의심함.'},
{'title': '방약무인', 'ex': '곁에 사람이 없는 것처럼 아무 거리낌 없이 함부로 말하고 행동하는 태도가 있음.'},
{'title': '백년하청',
 'ex': '중국의 황허강(黃河江)이 늘 흐려 맑을 때가 없다는 뜻으로, 아무리 오랜 시일이 지나도 어떤 일이 이루어지기 어려움을 이르는 말.'},
{'title': '백중지세', 'ex': '서로 우열을 가리기 힘든 형세.'},
{'title': '막상막하', 'ex': '더 낫고 더 못함의 차이가 거의 없음.'},
{'title': '부화뇌동', 'ex': '줏대 없이 남의 의견에 따라 움직임.'},
{'title': '비분강개', 'ex': '슬프고 분하여 마음이 북받침.'},
{'title': '사필귀정', 'ex': '모든 일은 반드시 바른길로 돌아감.'},
{'title': '살신성인', 'ex': '자기의 몸을 희생하여 인(仁)을 이룸.'},
{'title': '상전벽해',
 'ex': '뽕나무밭이 변하여 푸른 바다가 된다는 뜻으로, 세상일의 변천이 심함을 비유적으로 이르는 말.'},
{'title': '난형난제',
 'ex': '누구를 형이라 하고 누구를 아우라 하기 어렵다는 뜻으로, 두 사물이 비슷하여 낫고 못함을 정하기 어려움을 이르는 말.'},
{'title': '새옹지마',
 'ex': '인생의 길흉화복은 변화가 많아서 예측하기가 어렵다는 말.'},
{'title': '설상가상', 'ex': '눈 위에 서리가 덮인다는 뜻으로, 난처한 일이나 불행한 일이 잇따라 일어남을 이르는 말.'},
{'title': '설왕설래', 'ex': '서로 변론을 주고받으며 옥신각신함. 또는 말이 오고 감.'},
{'title': '소탐대실', 'ex': '작은 것을 탐하다가 큰 것을 잃음.'},
{'title': '속수무책', 'ex': '손을 묶은 것처럼 어찌할 도리가 없어 꼼짝 못 함.'},
{'title': '수원수구', 'ex': '누구를 원망하고 누구를 탓하겠냐는 뜻으로, 남을 원망하거나 탓할 것이 없음을 이르는 말.'},
{'title': '수구초심',
 'ex': '여우가 죽을 때에 머리를 자기가 살던 굴 쪽으로 둔다는 뜻으로, 고향을 그리워하는 마음을 이르는 말.'},
{'title': '수수방관', 'ex': '팔짱을 끼고 보고만 있다는 뜻으로, 간섭하거나 거들지 아니하고 그대로 버려둠을 이르는 말.'},
{'title': '수주대토',
 'ex': '한 가지 일에만 얽매여 발전을 모르는 어리석은 사람을 비유적으로 이르는 말. 중국 송나라의 한 농부가 우연히 나무 그루터기에 토끼가 부딪쳐 죽은 것을 잡은 후, 또 그와 같이 토끼를 잡을까 하여 일도 하지 않고 그루터기만 지키고 있었다는 데서 유래한다. ≪한비자≫의 <오두편(五蠹篇)>에 나오는 말이다.'},
{'title': '순망치한',
 'ex': '입술이 없으면 이가 시리다는 뜻으로, 서로 이해관계가 밀접한 사이에 어느 한쪽이 망하면 다른 한쪽도 그 영향을 받아 온전하기 어려움을 이르는 말.'},
{'title': '식자우환', 'ex': '학식이 있는 것이 오히려 근심을 사게 됨.'},
{'title': '아전인수', 'ex': '자기 논에 물 대기라는 뜻으로, 자기에게만 이롭게 되도록 생각하거나 행동함을 이르는 말.'},
{'title': '안분지족', 'ex': '편안한 마음으로 제 분수를 지키며 만족할 줄을 앎.'},
{'title': '안빈낙도', 'ex': '가난한 생활을 하면서도 편안한 마음으로 도를 즐겨 지킴.'}]}





datas[2] = {"time" : "1학기 기말고사",  "type": "어휘", "d" : [{'title': '나열', 'ex': '여러 가지를 죽 벌여 놓음.'},
{'title': '낙관적',
 'ex': '①인생이나 사물을 밝고 희망적인 것으로 보는 것. ②앞으로의 일 따위가 잘되어 갈 것으로 여기는 것.'},
{'title': '낙천적', 'ex': '세상과 인생을 즐겁고 좋은 것으로 여기는 것.'},
{'title': '난해성', 'ex': '뜻을 이해하기 어려운 성질이나 요소.'},
{'title': '남용',
 'ex': '①일정한 기준이나 한도를 넘어서 함부로 씀. ②권리나 권한 따위를 본래의 목적이나 범위를 벗어나 함부로 행사함.'},
{'title': '낭만적', 'ex': '①현실에 매이지 않고 감상적이고 이상적으로 사물을 대하는 것. ②감미롭고 감상적인 것.'},
{'title': '내면세계', 'ex': '겉으로 드러나지 아니하는 마음속의 감정이나 심리.'},
{'title': '내면화', 'ex': '정신적ㆍ심리적으로 깊이 마음속에 자리 잡힘. 또는 그렇게 되게 함.'},
{'title': '내성적', 'ex': '겉으로 드러내지 아니하고 마음속으로만 생각하는 것.'},
{'title': '내포',
 'ex': '①어떤 개념의 내용이 되는 여러 속성. ②내부에 포함하여 가짐. 특히 문학 작품에서 문맥상으로 한 단어나 구절이 동시에 다른 여러 뜻을 암시하거나 새롭게 이루어 내는 의미.'},
{'title': '냉소적', 'ex': '쌀쌀한 태도로 업신여기어 비웃는 것.'},
{'title': '논거', 'ex': '어떤 이론이나 논리, 논설 따위의 근거. 의견이나 주장의 타당성을 뒷받침해 주는 근거.'},
{'title': '논리', 'ex': '말이나 글에서 사고나 추리 따위를 이치에 맞게 이끌어 가는 과정이나 원리.'},
{'title': '논리적', 'ex': '생각하는 방법이나 이야기의 줄거리 따위가 이치에 맞는 것.'},
{'title': '논박', 'ex': '어떤 주장이나 의견에 대하여 그 잘못된 점을 조리 있게 공격하여 말함.전체 보기'},
{'title': '논증', 'ex': '옳고 그름을 이유를 들어 밝힘. 의견이나 주장을 논거를 들어 증명함.'},
{'title': '논지', 'ex': '논하는 말이나 글의 취지.'},
{'title': '논평', 'ex': '어떤 글이나 말 또는 사건 따위의 내용에 대하여 논하여 비평함. 또는 그런 비평.'},
{'title': '농후하다', 'ex': '①맛, 빛깔, 성분 따위가 매우 짙다. ②어떤 경향이나 기색 따위가 뚜렷하다.'},
{'title': '능동적', 'ex': '다른 것에 이끌리지 아니하고 스스로 일으키거나 움직이는 것.'},
{'title': '단계적', 'ex': '일의 차례를 따라 나아가는 과정.'},
{'title': '단정적', 'ex': '딱 잘라서 판단하고 결정하는 것.'},
{'title': '단호하다', 'ex': '결심이나 태도, 입장 따위가 과단성 있고 엄격하다.'},
{'title': '달관',
 'ex': '①사소한 사물이나 일에 얽매이지 않고 세속을 벗어난 활달한 식견이나 인생관에 이름. 또는 그 식견이나 인생관. ② 사물에 통달한 식견이나 관찰.'},
{'title': '담보', 'ex': '맡아서 보증함.'},
{'title': '당위적', 'ex': '마땅히 그렇게 하거나 되어야 하는 것.'},
{'title': '당착', 'ex': '말이나 행동 따위의 앞뒤가 맞지 않음.'},
{'title': '대등', 'ex': '서로 견주어 높고 낮음이나 낫고 못함이 없이 비슷함.'},
{'title': '대립', 'ex': '의견이나 처지, 속성 따위가 서로 반대되거나 모순됨. 또는 그런 관계.'},
{'title': '대별', 'ex': '크게 구별하여 나눔.'},
{'title': '대비', 'ex': '두 가지의 차이를 밝히기 위하여 서로 맞대어 비교함. 또는 그런 비교.'},
{'title': '대응',
 'ex': '①어떤 일이나 사태에 맞추어 태도나 행동을 취함. ②어떤 두 대상이 주어진 어떤 관계에 의하여 서로 짝이 되는 일.'},
{'title': '대의명분',
 'ex': '①사람으로서 마땅히 지키고 행하여야 할 도리나 본분. ②어떤 일을 꾀하는 데 내세우는 합당한 구실이나 이유.'},
{'title': '대조', 'ex': '①둘 이상인 대상의 내용을 맞대어 같고 다름을 검토함. ②서로 달라서 대비가 됨.'},
{'title': '대중적', 'ex': '수많은 사람의 무리를 중심으로 한 것. 널리 일반 민중을 중심으로 한 것.'},
{'title': '도구적', 'ex': '어떤 목적을 이루기 위한 수단이나 방법의 것.'},
{'title': '도래', 'ex': '어떤 시기나 기회가 닥쳐옴.'},
{'title': '도식적', 'ex': '일정한 형식이나 틀에 기계적으로 맞추려는 경향 같은 것.'},
{'title': '도식화',
 'ex': '①사물의 구조, 관계, 변화 상태 따위를 그림이나 양식으로 만듦. ②사물의 본질이나 특성이 구체적으로 밝혀지기 위한 인간의 창조적 태도 없이, 일정한 형식이나 틀에 기계적으로 맞춰짐. 또는 만듦.'},
{'title': '도외시', 'ex': '상관하지 아니하거나 무시함.'},
{'title': '도약', 'ex': '더 높은 단계로 발전하는 것을 비유적으로 이르는 말.'},
{'title': '도출', 'ex': '판단이나 결론 따위를 이끌어 냄.'},
{'title': '도취', 'ex': '어떠한 것에 마음이 쏠려 취하다시피 됨.'},
{'title': '도피적', 'ex': '어떤 대상에서 벗어나려 하거나 적극적으로 나서야 할 일에 몸을 사려 빠지는 것.'},
{'title': '독단', 'ex': '남과 상의하지 않고 혼자서 판단하거나 결정함.'},
{'title': '독자성', 'ex': '다른 것과 구별되는 혼자만의 특유한 성질.'},
{'title': '독창적', 'ex': '다른 것을 모방함이 없이 새로운 것을 처음으로 만들어 내거나 생각해 내는 것.'},
{'title': '동경', 'ex': '①어떤 것을 간절히 그리워하여 그것만을 생각함. ②마음이 스스로 들떠서 안정되지 아니함.'},
{'title': '동시적', 'ex': '같은 시간에 함께 하는 것.'},
{'title': '동일성', 'ex': '두 개 이상의 사상(事象)이나 사물이 서로 같은 성질.'},
{'title': '동일시', 'ex': '둘 이상의 것을 똑같은 것으로 봄.'},
{'title': '동적', 'ex': '움직이고 있는, 힘이 작용하고 있는 것. ◯반 정적(靜的)'},
{'title': '동조', 'ex': '남의 주장에 자기의 의견을 일치시키거나 보조를 맞춤.'},
{'title': '동질성', 'ex': '사람이나 사물의 바탕이 같은 성질이나 특성.'},
{'title': '동태', 'ex': '움직이거나 변하는 모습.'},
{'title': '득의', 'ex': '일이 뜻대로 이루어져 만족해하거나 뽐냄.'},
{'title': '등한시', 'ex': '소홀하게 보아 넘김.'},
{'title': '내레이션',
 'ex': '영화, 방송극, 연극 따위에서, 장면에 나타나지 않으면서 장면의 진행에 따라 그 내용이나 줄거리를 장외(場外)에서 해설하는 일. 또는 그런 해설.'},
{'title': '내재적',
 'ex': '접근 방법 작품을 그 자체만으로 분석, 비평, 감상하는 방법. 절대주의적 관점, 구조론적 관점이라고도 부름.'},
{'title': '대구', 'ex': '비슷한 어조나 어세를 가진 어구를 짝 지어 표현의 효과를 나타내는 표현 방법.'},
{'title': '대유', 'ex': '사물의 일부나 특징을 들어서 그 전체를 나타내는 비유법.'},
{'title': '도치', 'ex': '①차례나 위치 따위를 서로 뒤바꿈. ②문장 안에서 정상적인 어순 따위를 뒤바꿈.'},
{'title': '막연하다', 'ex': '①갈피를 잡을 수 없게 아득하다. ②뚜렷하지 못하고 어렴풋하다.'},
{'title': '매개', 'ex': '둘 사이에서 양편의 관계를 맺어 줌.'},
{'title': '맥락', 'ex': '사물 따위가 서로 이어져 있는 관계나 연관.'},
{'title': '맹목적', 'ex': '사리를 따지지 않고 주관이나 원칙이 없이 덮어놓고 행동하는 것.'},
{'title': '면모', 'ex': '사람이나 사물의 겉모습. 또는 그 됨됨이.'},
{'title': '면목', 'ex': '①얼굴의 생김새. ②남을 대할 만한 체면. ③사람이나 사물의 겉모습.'},
{'title': '명료하다', 'ex': '뚜렷하고 분명하다.'},
{'title': '명분',
 'ex': '①각각의 이름이나 신분에 따라 마땅히 지켜야 할 도리. 군신, 부자, 부부 등 구별된 사이에 서로가 지켜야 할 도덕상의 일을 이른다. ②일을 꾀할 때 내세우는 구실이나 이유 따위.'},
{'title': '명시적', 'ex': '내용이나 뜻을 분명하게 드러내 보이는.'},
{'title': '명제', 'ex': '어떤 문제의 진위, 의견, 주장, 판단 등을 문장이나 기호로 나타낸 것.'},
{'title': '모색', 'ex': '일이나 사건 따위를 해결할 수 있는 방법이나 실마리를 더듬어 찾음.'},
{'title': '모순', 'ex': '어떤 사실의 앞뒤, 또는 두 사실이 이치상 어긋나서 서로 맞지 않음을 이르는 말.'},
{'title': '모호하다', 'ex': '말이나 태도가 흐리터분하여 분명하지 않다.'},
{'title': '목가적', 'ex': '자연적 낭만을 느낄 수 있는 목장이나 농촌 풍경의 것.'},
{'title': '몽환적', 'ex': '현실이 아닌 꿈이나 환상과 같은 것.'},
{'title': '몰각', 'ex': '①아주 없애 버림. ②무시해 버림.'},
{'title': '묘미', 'ex': '미묘한 재미나 흥취.'},
{'title': '묘사적', 'ex': '있는 그대로의 모습을 그림 그린 듯이 자세히 보여 주는 것.'},
{'title': '무상감', 'ex': '모든 것이 덧없다는 느낌.'},
{'title': '묵과', 'ex': '잘못을 알고도 모르는 체하고 그대로 넘김.'},
{'title': '문맥적', 'ex': '의미 단어가 실제 문장에서 사용된 의미, 즉 글의 흐름(문맥)에 따라 결정되는 의미.'},
{'title': '미시적',
 'ex': '①사람의 감각으로 직접 식별할 수 없을 만큼 몹시 작은 현상에 관한 것. ②사물이나 현상을 전체적인 면에서가 아니라 개별적으로 포착하여 분석하는 것.'},
{'title': '미학적', 'ex': '자연이나 인생 및 예술 따위에 담긴 미의 본질과 구조를 해명하는 학문을 바탕으로 하는 것.'},
{'title': '문어체', 'ex': '일상적인 대화에서 쓰는 말투가 아닌, 글에서 주로 쓰는 말투.'},
{'title': '미의식', 'ex': '미를 느끼거나 이해하는 감각과 경험, 창작하거나 감상할 때의 미에 대한 개인적인 의식.'},
{'title': '반어', 'ex': '표현의 효과를 높이기 위하여 실제와 반대되는 뜻의 말을 하는 것.'},
{'title': '반전',
 'ex': '위치, 방향, 순서 따위가 반대로 됨. ‘일의 형세가 뒤바뀜’의 뜻으로, 문학 작품에서 사 건의 흐름이 전혀 예기치 않은 방향으로 급박하게 변화하여 보는 이를 놀라게 만들며 주제를 부각시키는 기법.'},
{'title': '방백',
 'ex': '연극에서, 등장인물이 말을 하지만 무대 위의 다른 인물에게는 들리지 않고 관객만 들을 수 있는 것으로 약속되어 있는 대사.'},
{'title': '박진감', 'ex': '생동감 있고 활기차고 적극적이어서 현실적으로 느껴지는 느낌.'},
{'title': '반감', 'ex': '절반으로 줆. 또는 절반으로 줄임.'},
{'title': '반감', 'ex': '반대하거나 반항하는 감정.'},
{'title': '반목', 'ex': '서로서로 시기하고 미워함.'},
{'title': '반성적', 'ex': '자신의 언행에 대하여 잘못이나 부족함이 없는지 돌이켜 보는 것.'},
{'title': '반어적', 'ex': '표현의 효과를 높이기 위하여 실제와 반대되게 말을 하는 것.'},
{'title': '반영',
 'ex': '①빛이 반사하여 비침. ②다른 것에 영향을 받아 어떤 현상이 나타남. 또는 어떤 현상을 나타냄.'},
{'title': '반추', 'ex': '어떤 일을 되풀이하여 음미하거나 생각함. 또는 그런 일.'},
{'title': '발문', 'ex': '책의 끝에 본문 내용의 대강(大綱)이나 간행 경위에 관한 사항을 간략하게 적은 글.'},
{'title': '발상', 'ex': '어떤 생각을 해 냄. 또는 그 생각.'},
{'title': '배금주의', 'ex': '돈을 최고의 가치로 여기고 숭배하여 삶의 목적을 돈 모으기에 두는 경향이나 태도.'},
{'title': '배제', 'ex': '받아들이지 아니하고 물리쳐 제외함.'},
{'title': '배척', 'ex': '따돌리거나 거부하여 밀어 내침.'},
{'title': '배치', 'ex': '서로 반대로 되어 어그러지거나 어긋남.'},
{'title': '배치', 'ex': '사람이나 물자 따위를 일정한 자리에 나누어 둠.'},
{'title': '배타적', 'ex': '남을 거부하여 밀어내는 것.'},
{'title': '범용', 'ex': '여러 분야나 용도로 널리 쓰는 것.'},
{'title': '범주',
 'ex': '①동일한 성질을 가진 부류나 범위. ②철학에서 사물의 개념을 분류함에 있어 그 이상 일반화할 수 없는 보편적인 틀'},
{'title': '변증법',
 'ex': '모순 또는 대립을 근본 원리로 하여 사물의 발전 법칙을 설명하려는 논리. ‘정-반-합’의 단계를 거쳐 전개됨.'},
{'title': '병렬식',
 'ex': '문장의 재료를 시간적, 공간적 순서를 밟지 아니하고 항목별, 단위별로 나열하여 서술하여 나가는 문장 구성 방식.'},
{'title': '병치', 'ex': '두 가지 이상의 것을 한곳에 나란히 두거나 설치함.'},
{'title': '보수적', 'ex': '새로운 것이나 변화를 반대하고 전통적인 것을 옹호하며 유지하려는 것.'},
{'title': '보편적', 'ex': '모든 것에 두루 미치거나 통하는 것.'}]}



datas[3] = {
    "time" : "1학기 기말고사",  "type": "한자성어", 
    "d" : [{'title': '안하무인', 'ex': '눈 아래에 사람이 없다는 뜻으로, 방자하고 교만하여 다른 사람을 업신여김을 이르는 말.'},
    {'title': '애걸복걸', 'ex': '소원 따위를 들어 달라고 애처롭게 사정하며 간절히 빎.'},
    {'title': '애지중지', 'ex': '매우 사랑하고 소중히 여기는 모양.'},
    {'title': '역지사지', 'ex': '처지를 바꾸어서 생각하여 봄.'},
    {'title': '연목구어',
     'ex': '나무에 올라가서 물고기를 구한다는 뜻으로, 도저히 불가능한 일을 굳이하려 함을 비유적으로 이르는 말.'},
    {'title': '염화미소',
     'ex': '말로 통하지 아니하고 마음에서 마음으로 전하는 일. 석가모니가 영산회(靈山會)에서 연꽃 한 송이를 대중에게 보이자 마하가섭만이 그 뜻을 깨닫고 미소 지으므로 그에게 불교의 진리를 주었다고 하는 데서 유래한다.'},
    {'title': '오리무중',
     'ex': '오 리나 되는 짙은 안개 속에 있다는 뜻으로, 무슨 일에 대하여 방향이나갈피를 잡을 수 없음을 이르는 말.'},
    {'title': '오월동주',
     'ex': '서로 적의를 품은 사람들이 한자리에 있게 된 경우나 서로 협력하여야 하는 상황을 비유적으로 이르는 말. 중국 춘추 전국 시대에, 서로 적대시하는오나라 사람과 월나라 사람이 같은 배를 탔으나 풍랑을 만나서 서로 단합하여야 했다는 데에서 유래한다.'},
    {'title': '온고지신', 'ex': '옛것을 익히고 그것을 미루어서 새것을 앎.'},
    {'title': '외유내강', 'ex': '겉으로는 부드럽고 순하게 보이나 속은 곧고 굳셈.'},
    {'title': '요지부동', 'ex': '흔들어도 꼼짝하지 아니함. ‘꿋꿋한’, ‘움직이지 않는’, ‘흔들리지 않는’으로 순화.'},
    {'title': '유구무언', 'ex': '입은 있어도 말은 없다는 뜻으로, 변명할 말이 없거나 변명을 못함을 이르는 말.'},
    {'title': '유비무환', 'ex': '미리 준비가 되어 있으면 걱정할 것이 없음.'},
    {'title': '의기양양', 'ex': '뜻한 바를 이루어 만족한 마음이 얼굴에 나타난 모양.'},
    {'title': '이구동성', 'ex': '입은 다르나 목소리는 같다는 뜻으로, 여러 사람의 말이 한결같음을 이르는 말.'},
    {'title': '이란투석',
     'ex': '달걀로 돌을 친다는 뜻으로, 아주 약한 것으로 강한 것에 대항하려는 어리석음을 비유적으로 이르는 말.'},
    {'title': '이심전심', 'ex': '마음과 마음으로 서로 뜻이 통함.'},
    {'title': '이왕지사', 'ex': '이미 지나간 일.'},
    {'title': '인과응보',
     'ex': '전생에 지은 선악에 따라 현재의 행과 불행이 있고, 현세에서의 선악의 결과에 따라 내세에서 행과 불행이 있는 일.'},
    {'title': '일거양득', 'ex': '한 가지 일을 하여 두 가지 이익을 얻음.'},
    {'title': '일벌백계',
     'ex': '한 사람을 벌주어 백 사람을 경계한다는 뜻으로, 다른 사람들에게 경각심을 불러일으키기 위하여 본보기로 한 사람에게 엄한 처벌을 하는 일을 이르는 말.'},
    {'title': '일석이조', 'ex': '돌 한 개를 던져 새 두 마리를 잡는다는 뜻으로, 동시에 두 가지 이득을봄을 이르는 말.'},
    {'title': '일진일퇴', 'ex': '한 번 앞으로 나아갔다 한 번 뒤로 물러섰다 함.'},
    {'title': '일편단심', 'ex': '한 조각의 붉은 마음이라는 뜻으로, 진심에서 우러나오는 변치 아니하는마음을 이르는 말.'},
    {'title': '일희일비',
     'ex': '1. 한편으로는 기뻐하고 한편으로는 슬퍼함. 또는 기쁨과 슬픔이 번갈아일어남. 2. 한편으로는 기쁘고 한편으로는 슬픔.'},
    {'title': '입신양명', 'ex': '출세하여 이름을 세상에 떨침.'},
    {'title': '자가당착', 'ex': '같은 사람의 말이나 행동이 앞뒤가 서로 맞지 아니하고 모순됨.'},
    {'title': '자승자박',
     'ex': '자기의 줄로 자기 몸을 옭아 묶는다는 뜻으로, 자기가 한 말과 행동에 자기 자신이 옭혀 곤란하게 됨을 비유적으로 이르는 말.'},
    {'title': '자업자득', 'ex': '자기가 저지른 일의 결과를 자기가 받음.'},
    {'title': '자중지란', 'ex': '같은 편끼리 하는 싸움.'},
    {'title': '자포자기', 'ex': '절망에 빠져 자신을 스스로 포기하고 돌아보지 아니함.'},
    {'title': '적반하장',
     'ex': '도둑이 도리어 매를 든다는 뜻으로, 잘못한 사람이 아무 잘못도 없는 사람을 나무람을 이르는 말.'},
    {'title': '전전긍긍', 'ex': '몹시 두려워서 벌벌 떨며 조심함.'},
    {'title': '전전반측', 'ex': '누워서 몸을 이리저리 뒤척이며 잠을 이루지 못함.'},
    {'title': '전화위복', 'ex': '재앙과 화난이 바뀌어 오히려 복이 됨.'},
    {'title': '절치부심', 'ex': '몹시 분하여 이를 갈며 속을 썩임.'},
    {'title': '점입가경',
     'ex': '1. 들어갈수록 점점 재미가 있음. 2. 시간이 지날수록 하는 짓이나 몰골이 더욱 꼴불견임을 비유적으로 이르는 말.'},
    {'title': '조변석개',
     'ex': '아침저녁으로 뜯어고친다는 뜻으로, 계획이나 결정 따위를 일관성이 없이자주 고침을 이르는 말.'},
    {'title': '조삼모사',
     'ex': '간사한 꾀로 남을 속여 희롱함을 이르는 말. 중국 송나라의 저공(狙公)의고사로, 먹이를 아침에 세 개, 저녁에 네 개씩 주겠다는 말에는 원숭이들이적다고 화를 내더니 아침에 네 개, 저녁에 세 개씩 주겠다는 말에는 좋아하였다는 데서 유래한다.'},
    {'title': '좌고우면', 'ex': '이쪽저쪽을 돌아본다는 뜻으로, 앞뒤를 재고 망설임을 이르는 말.'},
    {'title': '좌불안석',
     'ex': '앉아도 자리가 편안하지 않다는 뜻으로, 마음이 불안하거나 걱정스러워서한군데에 가만히 앉아 있지 못하고 안절부절못하는 모양을 이르는 말.'},
    {'title': '중구난방',
     'ex': '뭇사람의 말을 막기가 어렵다는 뜻으로, 막기 어려울 정도로 여럿이 마구지껄임을 이르는 말. ‘마구 떠듦’으로 순화.'},
    {'title': '지기지우', 'ex': '자기의 속마음을 참되게 알아주는 친구.'},
    {'title': '지리멸렬', 'ex': '이리저리 흩어지고 찢기어 갈피를 잡을 수 없음.'},
    {'title': '진퇴양난', 'ex': '이러지도 저러지도 못하는 어려운 처지.'},
    {'title': '진퇴유곡', 'ex': '이러지도 저러지도 못하고 꼼짝할 수 없는 궁지.'},
    {'title': '창해일속',
     'ex': '넓고 큰 바닷속의 좁쌀 한 알이라는 뜻으로, 아주 많거나 넓은 것 가운데있는 매우 하찮고 작은 것을 이르는 말.'},
    {'title': '천려일실',
     'ex': '천 번 생각에 한 번 실수라는 뜻으로, 슬기로운 사람이라도 여러 가지 생각 가운데에는 잘못되는 것이 있을 수 있음을 이르는 말.'},
    {'title': '천려일득',
     'ex': '천 번을 생각하여 하나를 얻는다는 뜻으로, 어리석은 사람이라도 많은 생각을 하면 그 과정에서 한 가지쯤은 좋은 것이 나올 수 있음을 이르는 말.'},
    {'title': '천양지차', 'ex': '하늘과 땅 사이와 같이 엄청난 차이.'},
    {'title': '천재일우', 'ex': '천 년 동안 단 한 번 만난다는 뜻으로, 좀처럼 만나기 어려운 좋은 기회를이르는 말.'},
    {'title': '청천벽력',
     'ex': '맑게 갠 하늘에서 치는 날벼락이라는 뜻으로, 뜻밖에 일어난 큰 변고나 사건을 비유적으로 이르는 말.'},
    {'title': '청출어람',
     'ex': '쪽에서 뽑아낸 푸른 물감이 쪽보다 더 푸르다는 뜻으로, 제자나 후배가 스승이나 선배보다 나음을 비유적으로 이르는 말.'},
    {'title': '침소봉대', 'ex': '작은 일을 크게 불리어 떠벌림.'},
    {'title': '타산지석',
     'ex': '다른 산의 나쁜 돌이라도 자신의 산의 옥돌을 가는 데에 쓸 수 있다는 뜻으로, 본이 되지 않은 남의 말이나 행동도 자신의 지식과 인격을 수양하는데에 도움이 될 수 있음을 비유적으로 이르는 말.'},
    {'title': '토사구팽',
     'ex': '토끼가 죽으면 토끼를 잡던 사냥개도 필요 없게 되어 주인에게 삶아 먹히게 된다는 뜻으로, 필요할 때는 쓰고 필요 없을 때는 야박하게 버리는 경우를 이르는 말.'},
    {'title': '표리부동', 'ex': '겉으로 드러나는 언행과 속으로 가지는 생각이 다름.'},
    {'title': '풍수지탄', 'ex': '효도를 다하지 못한 채 어버이를 여읜 자식의 슬픔을 이르는 말.'},
    {'title': '학수고대', 'ex': '학의 목처럼 목을 길게 빼고 간절히 기다림.'},
    {'title': '허장성세', 'ex': '실속은 없으면서 큰소리치거나 허세를 부림.'},
    {'title': '호가호위',
     'ex': '남의 권세를 빌려 위세를 부림. ≪전국책≫의 <초책(楚策)>에 나오는 말로 여우가 호랑이의 위세를 빌려 호기를 부린다는 데에서 유래한다.'},
    {'title': '호구지책', 'ex': '가난한 살림에서 그저 겨우 먹고살아 가는 방책.'},
    {'title': '혼비백산', 'ex': '혼백이 어지러이 흩어진다는 뜻으로, 몹시 놀라 넋을 잃음을 이르는 말.'},
    {'title': '환골탈태',
     'ex': '1. 뼈대를 바꾸어 끼고 태를 바꾸어 쓴다는 뜻으로, 고인의 시문의 형식을바꾸어서 그 짜임새와 수법이 먼저 것보다 잘되게 함을 이르는 말. 2.사람이 보다 나은 방향으로 변하여 전혀 딴사람처럼 됨.'},
    {'title': '후안무치', 'ex': '뻔뻔스러워 부끄러움이 없음.'},
    {'title': '후회막급', 'ex': '이미 잘못된 뒤에 아무리 후회하여도 다시 어찌할 수가 없음.'}]
}

datas[4] = {
    'time': '2학기 중간고사',
    'type': '속담',
    'd': [{
        'title': '가까운 제 눈썹 못 본다.',
        'ex': '멀리 보이는 것은 용케 잘 보면서도 자기 눈앞에 가깝게 보이는 것은 잘못 봄.'
    },
    {
        'title': '가꿀 나무는 밑동을 높이 자른다.',
        'ex': '어떠한 일이나 장래의 안목을 생각해서 미리부터 준비를 철저하게 해 두어야 함.'
    },
    { 'title': '가난한 놈은 성도 없나.', 'ex': '가난한 사람이 괄시 당할 때 하는 말.' },
    { 'title': '가난한 집 제사 돌아오듯 한다.', 'ex': '힘든 일이 자주 닥쳐옴.' },
    { 'title': '가난한 놈이 기와집만 짓는다.', 'ex': '가난하고 구차하게 사는 사람일수록 공상만 많이 하여 허풍을 떤다.' },
    {
        'title': '가난한 집 족보 자랑하기.',
        'ex': '가난뱅이 양반은 자신을 자랑할 만한 것이 없기 때문에 자기의 조상 자랑만 늘어놓음.'
    },
    {
        'title': '가는 님은 밉상이요, 오는 님은 곱상이다.',
        'ex': '말려도 뿌리치고 가는 님은 미워도 기다리던 끝에 오는 님은 반갑다.'
    },
    { 'title': '가는 방망이, 오는 홍두깨.', 'ex': '섣불리 남을 해치려다 도리어 큰 화를 입음.' },
    { 'title': '가는 날이 장날이다.', 'ex': '어떤 일을 하려고 하는데 뜻하지 않은 일을 공교롭게 당함.' },
    { 'title': '가랑잎에 불붙이기.', 'ex': '성미가 급하고 도량이 좁은 사람을 이르는 말.' },
    {
        'title': '가랑잎이 솔잎더러 바스락거린다고 한다.',
        'ex': '자기 허물이 더 크고 많은 사람이 도리어 허물이 작은 사람을 나무람.'
    },
    {
        'title': '가루는 칠수록 고와지고 말은 할수록 거칠어진다.',
        'ex': '가루는 체에 칠수록 고와지지만 말은 길어질수록 시비가 붙을 수 있고 마침내는 말다툼까지 가게 되니 말을 삼가라는 말.'
    },
    {
        'title': '가마 속의 콩도 삶아야 먹는다.',
        'ex': '아무리 쉬운 일이라도 움직여서 손대지 않으면 제게 이익이 돌아오지 않음.'
    },
    { 'title': '가만히 먹으라니까 뜨겁다고 한다.', 'ex': '눈치 없이 비밀리 한 일을 드러냄.' },
    {
        'title': '가을에는 부지깽이도 덤벙인다.',
        'ex': '추수하는 가을이 되면 농촌에는 일하지 않는 사람이 없을 정도로 매우 바쁨. 분주함을비유적으로 이르거나 어떤 물건이 마구 대용됨을 이르기도 한다.'
    },
    { 'title': '가을바람에 새털 날 듯 한다.', 'ex': '가을바람에 새털이 잘 날듯이 사람의 처신머리가 몹시 가볍다는 뜻.' },
    { 'title': '가자니 태산이요 돌아서자니 숭산이라.', 'ex': '앞으로 가지도, 뒤로 돌아갈 수도 없는 난처한 지경.' },
    {
        'title': '가재 뒷걸음이나 게 옆걸음이나.',
        'ex': '가재가 뒤로 가는 것이나 게가 옆으로 가는 것이나 앞으로 가지 않는 것은 매일반임.'
    },
    { 'title': '가죽 없는 털은 없다.', 'ex': '세상만사는 모두 그 근원이 있다.' },
    { 'title': '가지 따먹고 외수 한다.', 'ex': '남의 눈을 피하여 나쁜 짓하고 시치미를 뗀다.(외수: 남을 속이는 꾀)' },
    { 'title': '갈치가 갈치 꼬리 문다.', 'ex': '친근한 사이에 서로 모함한다.' },
    { 'title': '고뿔도 남을 안 준다.', 'ex': '감기까지도 안 줄 정도로 인색하다.' },
    { 'title': '감나무 밑에서 입만 벌리고 있다.', 'ex': '요행수를 바람.' },
    { 'title': '갓 쓰고 자전거 탄다.', 'ex': '어울리지 않아 어색하다.' },
    {
        'title': '강아지 메주 멍석 맡긴 것 같다.',
        'ex': '믿지 못할 사람에게 일을 맡겨 놓고 마음이 놓이지 않아 불안해 함.'
    },
    { 'title': '개같이 벌어서 정승같이 쓴다.', 'ex': '비천하게 벌어서라도 떳떳이 가장 보람 있게 쓴다.' },
    {
        'title': '개꼬리는 먹이를 탐내서 흔든다.',
        'ex': '누구에게나 반가운 척하는 사람의 이면에는 대부분 야심이 숨겨져 있음.'
    },
    {
        'title': '개 꼬리 3년 두어도 황모 못 된다.',
        'ex': '개 꼬리를 삼년씩이나 묻어두어도 황모(족제비의 꼬리털로 붓 매는데 씀.)는 안 된다는 뜻으로 워낙 본성이 나쁜 것은 아무리 오래 되어도 좋게 변하지 않는다.'
    },
    { 'title': '개는 잘 짖는다고 좋은 개는 아니다.', 'ex': '모름지기 사람은 말보다 처신을 잘해야 훌륭한 사람이다.' },
    {
        'title': '개도 무는 개는 돌아본다.',
        'ex': '같은 개끼리도 사나운 개를 두려워하듯이, 사람도 악한 사람에게는 혹시 그 화를 입을까 하여조심하고 잘 대해준다.'
    },
    {
        'title': '개똥참외도 먼저 맡은 놈이 임자다.',
        'ex': '아무리 임자 없이 굴러다니는 물건이라도 먼저 와서 맡은 사람이 주인.'
    },
    {
        'title': '개 못된 것은 들에 나가 짖는다.',
        'ex': '개는 집을 지키며 집에서 짖는 짐승인데 못된 개는 쓸데없이 들판에 나가 짖는다는뜻으로, 제가 마땅히 해야 할 일은 하지 아니하고 아무 소용도 없는 데 가서 잘난 체하고 떠드는 행동을 이르는 말.'
    },
    {
        'title': '개미 나는 곳에 범 난다.',
        'ex': '처음에는 작고 대수롭지 않던 것이 점점 커져서 나중에는 크고 무서운 것이 된다.'
    },
    { 'title': '개 보름 쇠듯 한다.', 'ex': '명절날 맛 좋은 음식도 해 먹지 못하고 그냥 넘긴다.' },
    {
        'title': '개살구가 먼저 익는다.',
        'ex': '맛없는 개살구가 맛좋은 참살구보다 먼저 익듯이 나쁜 일이 선한 것보다 더 발전하게 됨.'
    },
    { 'title': '개살구가 지레 터진다.', 'ex': '되지 못한 사람이 오히려 잘난 체하며 뽐내거나 남보다 먼저 나섬.' },
    { 'title': '객지 벗도 사귈 탓이다.', 'ex': '객지에서 오래 사귀지 않은 친구라도 친하기에 따라 형제처럼 될 수 있다.' },
    {
        'title': '거미도 줄을 쳐야 벌레를 잡는다.',
        'ex': '무슨 일을 하거나 거기에 필요한 준비나 도구가 있어야 그 목적에 달성할 수 있다.'
    },
    { 'title': '거미줄로 방귀 동이 듯.', 'ex': '일을 함에 있어 건성으로 함.' },
    { 'title': '거지는 모닥불에 살찐다.', 'ex': '아무리 어려운 사람이라도 무엇이든 하나쯤은 사는 재미가 있다.' },
    {
        'title': '건너다보니 절터.',
        'ex': '일의 결과가 신통치 않음이 뻔히 내다보인다는 말. 아무리 욕심을 내어도 남의 것이기 때문에 뜻대로할 수 없다는 말'
    },
    {
        'title': '건드리지 않은 벌이 쏠까.',
        'ex': '내가 남에게 특별히 해를 끼치지 않는 한 상대방도 나를 못살게 굴지 않는다.'
    },
    {
        'title': '검둥개 멱 감긴 격.',
        'ex': '검정개를 목욕시킨다고 하얗게 될 리가 없듯이 본바탕이 나쁘고 고약한 사람은 고칠 수가 없다.'
    },
    {
        'title': '검은 고양이 눈감듯 한다.',
        'ex': '검은 고양이가 눈을 뜨나 감으나 잘 알아보지 못하듯이 어떠한 일에 사리를 분별하기가 어려움.'
    },
    { 'title': '겸손도 지나치면 믿지 못한다.', 'ex': '지나치게 겸손하면 위선으로 변하게 된다.' },
    {
        'title': '경치고 포도청 간다.',
        'ex': '죽을 고비를 넘겨가면서도 또 제 스스로 고문을 당하려고 포도청을 가듯이 혹독한 형벌을 거듭 당함.'
    },
    { 'title': '고기도 저 놀던 물이 좋다.', 'ex': '자기가 살던 정든 고장, 정든 사람들과 같이 지내는 것이 좋다.' },
    { 'title': '고름이 살 되랴.', 'ex': '이왕 그르친 일은 돌이킬 수 없으니 깨끗이 단념하라.' },
    {
        'title': '고사리도 꺾을 때 꺾어야 한다.',
        'ex': '무슨 일이든 그에 알맞은 시기가 있으니 그 때를 놓치지 말고 하라.'
    },
    {
        'title': '고슴도치도 제 새끼가 함함하다면 좋아한다.',
        'ex': '누구나 칭찬하여 주면 좋아한다.(함함하다: 털이 보드랍고 윤이 나다)'
    },
    { 'title': '고양이 세수하듯 한다.', 'ex': '남이 하는 대로 흉내만 내고 그치는 경우를 이름.' },
    { 'title': '고추밭에 말 달리기.', 'ex': '매우 심술이 사납다는 뜻' },
    { 'title': '곤장을 메고 매 맞으러 간다.', 'ex': '스스로 화를 자초한다.' },
    { 'title': '곧은 나무 먼저 찍힌다.', 'ex': '똑똑한 사람 또는 정직한 사람이 오히려 남의 모함을 받기 쉽다.' },
    { 'title': '곰이 가재 잡듯 한다.', 'ex': '동작이 굼뜬 곰이 가재 잡듯이 게으른 사람이 느리게 행동하는 것.' },
    { 'title': '공연한 제사 지내고 어물 값에 졸린다.', 'ex': '하지 않아도 될 일을 공연히 하고 그 후환을 입게 됨.' },
    { 'title': '광에서 인심 난다.', 'ex': '자기의 살림이 넉넉하고 유복해져야 비로소 남의 처지를 동정하게 된다.' },
    { 'title': '구멍을 보아 말뚝 깎는다.', 'ex': '형편을 보아가며 알맞게 일을 꾸려 나간다.' },
    { 'title': '구슬이 서 말이라도 꿰어야 보배다.', 'ex': '아무리 좋은 솜씨와 훌륭한 일이라도 끝을 마쳐야 쓸모가 있다.' },
    { 'title': '굳은 땅에 물이 고인다.', 'ex': '헤프지 않고 단단한 사람이 아껴서 재산을 모은다.' },
    { 'title': '굽은 나무가 선산을 지킨다.', 'ex': '쓸모없는 것이 도리어 소용됨.' },
    { 'title': '귀머거리 삼년, 벙어리 삼년.', 'ex': '시집살이의 어려움.' },
    { 'title': '귀신 씨나락 까먹는 소리.', 'ex': '보이지 않는 곳에서 몇 사람이 무엇이라 수근 거리는 소리' },
    { 'title': '그물이 열 자라도 벼리가 으뜸이다.', 'ex': '아무리 수가 많더라도 주장되는 것이 없으면 소용이 없다.' },
    { 'title': '급히 먹는 밥이 목에 멘다.', 'ex': '일을 급히 하면 실패하기 쉽다.' },
    { 'title': '기둥을 치면 대들보가 울린다.', 'ex': '직접 말하지 않고 간접으로 넌지시 말해도 알아들을 수가 있다는 뜻' },
    { 'title': '기름 엎지르고 깨 줍는다.', 'ex': '많은 손해를 보고 적은 이익을 추구한다.' },
    { 'title': '기와 한 장 아끼다가 대들보 썩힌다.', 'ex': '작은 것을 아끼다가 큰 손해를 본다.' },
    { 'title': '기운이 세면 소가 왕 노릇할까.', 'ex': '힘이 세다 해도 지략이 없으면 남의 지도적 위치에서 설 수 없음.' },
    {
        'title': '길마 무서워 소 드러누울까.',
        'ex': '일을 할 때 힘이 부족할까 미리 걱정할 것이 아니라 조금씩이라도 하라.'
    },
    { 'title': '까마귀도 내 땅 까마귀라면 반갑다.', 'ex': '무엇이든지 고향 것이라면 반갑다.' },
    { 'title': '꽃샘잎샘에 반늙은이 얼어 죽는다.', 'ex': '꽃피고 잎 나는 삼사월에는 날씨가 춥고 일기가 고르지 못함.' },
    { 'title': '끓는 국에 맛 모른다.', 'ex': '급한 일을 당하면 사리 판단을 옳게 할 수 없다.' },
    { 'title': '나간 사람 몫은 있어도 자는 사람 몫은 없다.', 'ex': '게으른 사람에게는 무엇을 남겼다 줄 필요도 없다.' },
    { 'title': '나는 바담풍 해도 너는 바람풍 해라.', 'ex': '저는 잘 못하면서 남만 잘 하라고 하는 사람.' },
    { 'title': '나도 덩더쿵 너도 덩더쿵.', 'ex': '서로 타협하지 않고 저마다 버티고 있음.' },
    { 'title': '나루 건너 배타기.', 'ex': '일의 순서가 뒤바뀜.' },
    { 'title': '나중 난 뿔이 우뚝하다.', 'ex': '후배가 선배보다 나을 때 하는 말.' },
    { 'title': '남의 떡에 설 쇤다.', 'ex': '남의 덕에 일이 이루어졌을 때 하는 말.' },
    {
        'title': '남의 속에 있는 글도 배운다.',
        'ex': '남의 마음속에 있는 글도 배우는 데 직접 보고 배우는 것이야 못할 것 없지 않느냐.'
    },
    { 'title': '남이 장에 간다고 하니 거름지고 나선다.', 'ex': '주관 없이 남의 행동에 따름.' },
    { 'title': '남의 친 장단에 궁둥이 춤춘다.', 'ex': '주관 없이 남의 행동에 따름.' },
    {
        'title': '내 칼도 남의 칼집에 들면 찾기 어렵다.',
        'ex': '자기의 물건이라도 남의 손에 들어가면 다시 찾기가 어렵다.'
    },
    { 'title': '노루 꼬리 길면 얼마나 길까.', 'ex': '실력이 있는 체 해도 실상은 보잘 것 없음을 비유한 말.' },
    { 'title': '노적가리에 불 지르고 싸라기 주워 먹는다.', 'ex': '큰 것을 잃고 적은 것을 아끼는 사람을 말함.' },
    { 'title': '놀부 제사지내듯 한다.', 'ex': '놀부가 제사를 지낼 때 재물대신 돈을 놓고 제사를 지냈듯이 몹시 인색함.' },
    { 'title': '누이 믿고 장가 안 간다.', 'ex': '도저히 불가능한 일만 하려고 하고 다른 방책을 세우지 않는 어리석음.' },
    { 'title': '눈으로 우물 메우기.', 'ex': '눈으로 우물을 메우면 눈이 녹아서 허사가 되듯이 헛되이 애만 쓴다.' },
    {
        'title': '눈이 눈을 못 본다.',
        'ex': '자기 눈으로 자기 눈을 못 보듯이 자기 결함은 자기의 주관적인 안목에서는 찾아내기 어렵다.'
    },
    { 'title': '늙은 말이 콩 마다 할까.', 'ex': '어떤 것을 거절하지 않고 오히려 더 좋아함.' },
    { 'title': '다리 아래서 원을 꾸짖는다.', 'ex': '직접 말을 못하고 안 들리는 곳에서 불평이나 욕을 하는 것.' },
    {
        'title': '다시 긷지 않겠다고 우물에 똥 눌까.',
        'ex': '다시 안 볼 것 같지만 얼마 안가서 그 사람에게 청할 것이 생김.'
    },
    { 'title': '달밤에 삿갓 쓰고 나온다.', 'ex': '미운 사람이 더 미운 짓만 한다.' },
    { 'title': '닭 소 보듯 소 닭 보듯.', 'ex': '서로 의가 상해서 친한 사이라도 남처럼 대하는 것.' },
    {
        'title': '닭 잡아 겪을 나그네 소 잡아 겪는다.',
        'ex': '처음에 소홀히 함으로써 결과가 매우 어렵게 된 경우를 말함.'
    },
    { 'title': '당나귀 귀치레 하듯 한다.', 'ex': '쓸데없는 데에 어울리지 않도록 장식하고 꾸미는 것.' },
    { 'title': '당장 먹기엔 곶감이 달다.', 'ex': '당장에 좋은 것은 한 순간 뿐이고 참으로 좋고 이로운 것이 못 된다.' },
    {
        'title': '대문은 넓어야 하고 귓문은 좁아야 한다.',
        'ex': '남의 말은 듣되 유익한 것과 해로운 것을 구별할 줄 알아야 한다.'
    },
    { 'title': '대신 댁 송아지 백정 무서운 줄 모른다.', 'ex': '자기 주인의 세력을 믿고 거만한 행동을 하는 사람' },
    { 'title': '대장장이 식칼이 논다.', 'ex': '마땅히 있음직한 곳에 오히려 없는 경우를 비유한 말.' },
    {
        'title': '대추나무 방망이다.',
        'ex': '대추나무로 만든 방망이 같이 단단하여 어렵고 힘든 일이라도 능히 참고 견딜 수 있다.'
    },
    { 'title': '더운 밥 먹고 식은 말한다.', 'ex': '하루 세끼 더운 밥 먹고 실없는 소리만 한다.' },
    { 'title': '도깨비 대동강 건너듯 하다.', 'ex': '일의 진행이 눈에는 잘 띄지는 않지만, 그 결과가 빨리 나타나는 것.' },
    { 'title': '도깨비도 수풀이 있어야 모인다.', 'ex': '의지할 곳이 있어야 무슨 일이나 이루어진다.' },
    { 'title': '도끼가 제 자루 못 찍는다.', 'ex': '자기 허물을 자기가 알아서 고치기 어렵다.' },
    { 'title': '도둑놈 개 꾸짖듯 한다.', 'ex': '남에게 들리지 않게 입 속으로 중얼거림을 말함.' },
    { 'title': '도둑을 맞으려면 개도 안 짖는다.', 'ex': '뜻밖에 손재를 당하려면 악운이 겹친다.' },
    {
        'title': '도둑의 때는 벗어도 자식의 때는 못 벗는다.',
        'ex': '도둑의 누명은 범인이 잡히면 벗을 수 있으나 자식의 잘못은 그 부모가'
    },
    {
        'title': '지지 않을 수 없다.',
        'ex': '도둑집 개는 짖지 않는다.윗사람이 나쁜 짓을 하면 아랫사람도 자기 할 일을 잊어버리고 태만함.'
    },
    {
        'title': '독을 보아 쥐를 못 잡는다.',
        'ex': '독 사이에 숨은 쥐를 독 깰까봐 못 잡듯이 감정 나는 일이 있어도 곁에 있는 사람 체면을생각해서 자신이 참는다.'
    },
    { 'title': '돈 떨어지자 입맛 난다.', 'ex': '무엇이나 뒤가 달리면 아쉬워지고 생각이 더 간절해진다.' },
    { 'title': '돋우고 뛰어야 복사뼈라.', 'ex': '날뛰어 보아야 별것이 아니다.' },
    { 'title': '돌절구도 밑 빠질 날이 있다.', 'ex': '아무리 단단한 것도 결단이 날 때가 있다.' },
    { 'title': '동네 색시 믿고 장가 못 간다.', 'ex': '터무니없는 것을 믿다가 일을 그르치게 된다.' },
    { 'title': '동헌에서 원님 칭찬하듯.', 'ex': '사실은 칭찬할 것도 없는데 공연히 꾸며서 칭찬하는 것.' },
    { 'title': '되 글을 가지고 말 글로 써먹는다.', 'ex': '글을 조금 배워 가지고 가장 효과 있게 써먹는다.' },
    { 'title': '되로 주고 말로 받는다.', 'ex': '남을 조금 건드렸다가 크게 앙갚음을 당함.' },
    {
        'title': '두레박은 우물 안에서 깨진다.',
        'ex': '정든 고장은 떠나기 어렵듯이 한 번 몸에 밴 직업은 죽을 때까지 종사하게 된다.'
    },
    { 'title': '두부 먹다 이 빠진다.', 'ex': '방심하다 뜻밖의 실수를 한다.' },
    {
        'title': '드는 정은 몰라도 나는 정은 안다.',
        'ex': '대인 관계에서 정이 드는 것은 의식하지 못해도 싫어질 때는 바로 느낄 수 있다.'
    },
    { 'title': '들에서 죽 쑨 놈은 나가도 죽 쑨다.', 'ex': '집에서 늘 일하던 사람은 다른 곳에 가도 일만 하게 된다.' },
    { 'title': '집에서 새는 바가지 들에 가도 샌다.', 'ex': '집에서 늘 일하던 사람은 다른 곳에 가도 일만 하게 된다.' },
    {
        'title': '등잔불에 콩 볶아 먹는 놈.',
        'ex': '어리석고 옹졸하며 하는 짓마다 보기에 답답할 일만 하는 사람을 두고 이름.'
    },
    { 'title': '등치고 간 내 먹는다.', 'ex': '겉으로는 제법 위하는 척하면서 실상으로는 해를 끼친다.' },
    { 'title': '딸이 셋이면 문 열어 놓고 잔다.', 'ex': '딸이 여럿이면 재산이 다 없어진다.' },
    { 'title': '땅 넓은 줄은 모르고 하늘 높은 줄만 안다.', 'ex': '키가 홀쭉하게 크고 마른 사람을 보고 하는 말.' },
    { 'title': '떡방아 소리 듣고 김칫국 찾는다.', 'ex': '준비가 너무 지나치게 빠름.' },
    { 'title': '똥 싼 주제에 애화타령 한다.', 'ex': '잘못하고도 뉘우치지 못하고 비위 좋게 행동하는 사람을 비웃는 말.' },
    { 'title': '뜨거운 국에 맛 모른다.', 'ex': '사리를 알지 못하고 날 뛰거나 혹은 무턱대고 행동하는 사람.' },
    { 'title': '뜨고도 못 보는 당달봉사.', 'ex': '무식하여 전혀 글을 못 본다.' },
    { 'title': '뜬 쇠도 달면 어렵다.', 'ex': '성질이 온화한 사람도 한 번 노하면 무섭다.' },
    { 'title': '마파람에 게 눈 감추듯.', 'ex': '음식을 어느 결에 먹었는지 모를 만큼 빨리 먹어 버림을 이름.' },
    { 'title': '말꼬리의 파리가 천리 간다.', 'ex': '남의 세력에 기운을 편다.' },
    { 'title': '말 많은 집이 장맛도 쓰다.', 'ex': '말 많은 집안은 살림도 잘 안 된다.' },
    { 'title': '말은 해야 맛이고, 고기는 씹어야 맛이다.', 'ex': '할 말은 해야 된다.' },
    { 'title': '맛없는 국이 뜨겁기만 하다.', 'ex': '못된 사람이 오히려 까다로움.' },
    { 'title': '망건 쓰고 세수한다.', 'ex': '일의 순서가 뒤바뀌었다.' },
    { 'title': '망치로 얻어맞고 홍두깨로 친다.', 'ex': '복수란 언제나 제가 받은 피해보다 더 무섭게 한다.' },
    { 'title': '맥도 모르고 침통 흔든다.', 'ex': '내용도 모르고 무턱대고 덤빔.' },
    { 'title': '명태 한 마리 놓고 딴전 본다.', 'ex': '곁에 벌여 놓고 있는 일보다는 딴 벌이하는 일이 있다.' },
    { 'title': '모난 돌이 정 맞는다.', 'ex': '말과 행동에 모가 나면 미움을 받는다.' },
    { 'title': '목마른 놈이 우물 판다.', 'ex': '제가 급해야 서둘러 일을 시작한다.' },
    { 'title': '못생긴 며느리 제삿날에 병난다.', 'ex': '미운 사람이 더욱 미운 짓만 한다.' },
    { 'title': '무당이 제 굿 못하고 소경이 저 죽을 날 모른다.', 'ex': '제가 할 일을 처리하기는 힘들다.' },
    { 'title': '물동이 이고 하늘 보기.', 'ex': '어리석은 행동을 한다.' },
    { 'title': '물 본 기러기 꽃 본 나비.', 'ex': '바라던 바를 이루어 득의양양함을 이름.' },
    { 'title': '물이 깊어야 고기가 모인다.', 'ex': '자기 덕이 커야 남이 많이 따름.' },
    {
        'title': '물이 깊을수록 소리가 없다.',
        'ex': '덕망이 높고 생각이 깊은 사람일수록 잘난 체 하거나 아는 체 떠벌이지 않는다.'
    },
    { 'title': '미친 체 하고 떡판에 엎드린다.', 'ex': '잘못인줄 알면서도 욕심을 부리는 것을 말함.' },
    {
        'title': '밀가루 장사하면 바람 불고 소금 장사하면 비가 온다.',
        'ex': '운수가 사나우면 당하는 일마다 공교롭게 안 된다.'
    },
    { 'title': '백일 장마에도 하루만 더 왔으면 한다.', 'ex': '자기 이익 때문에 자기 본위로 이야기하는 것.' },
    { 'title': '백짓장도 맞들면 낫다.', 'ex': '아무리 쉬운 일이라도 여럿이 하면 더 쉽다.' },
    { 'title': '뱁새는 작아도 알 만 잘 낳는다.', 'ex': '작아도 제 구실 못하는 법이 없다.' },
    { 'title': '버선이라면 뒤집어나 보이지.', 'ex': '상대방의 의심을 풀어주지 못하여 매우 답답하고 속상함.' },
    { 'title': '벙어리 속은 그 어미도 모른다.', 'ex': '설명을 듣지 않고는 그 내용을 알 수 없다.' },
    { 'title': '변죽을 치면 복판이 울린다.', 'ex': '슬며시 암시만 해 주어도 눈치가 빠른 사람은 곧 알아듣는다.' },
    { 'title': '병신자식이 효도한다.', 'ex': '생각지도 않은 사람이 일을 이루거나 했을 때.' },
    { 'title': '보기 좋은 떡이 먹기도 좋다.', 'ex': '겉모양이 좋은 것이 내용도 좋다.' },
    { 'title': '보리밥에는 고추장이 제격이다.', 'ex': '무엇이거나 자기의 격에 알맞도록 해야 좋다.' },
    { 'title': '보리 주면 오이 안 주랴.', 'ex': '제 것은 이끼면서 남만 인색하다고 여기는 사람에게 하는 말.' },
    { 'title': '봉사가 개천 나무란다.', 'ex': '제 잘못은 모르고 남을 탓한다.' },
    { 'title': '봉사 문고리 잡기.', 'ex': '소경이 문고리 잡기 어렵듯 아주 어려운 일을 두고 하는 말.' },
    {
        'title': '부잣집 외상보다 비렁뱅이 맞돈이 좋다.',
        'ex': '아무리 튼튼한 자리라도 뒤로 미루는 것보다는 현재 충실한 것이 좋다.'
    },
    { 'title': '부지런한 물레방아는 얼 새도 없다.', 'ex': '무슨 일이고 부지런히 하면 실수가 없고 성사가 됨.' },
    {
        'title': '부처님 위하여 불공하나.',
        'ex': '남을 위하는 것 같지마는 실상 사람이 하는 모든 일은 결국은 자기를 위하는 것이다.'
    },
    { 'title': '북은 칠수록 소리가 난다.', 'ex': '하면 할수록 손해만 커진다.' },
    { 'title': '분다 분다 하니 하루아침에 왕겨 석 섬 분다.', 'ex': '잘한다고 하니 너무 우쭐대서 무작정 자꾸 함.' },
    {
        'title': '비단 옷을 입으면 어깨가 올라간다.',
        'ex': '가난하게 살던 사람이 갑자기 돈을 벌게 되면 제 분수도 모르고 우쭐대게 된다.'
    },
    { 'title': '빛 좋은 개살구다.', 'ex': '겉만 좋고 실속은 없음.' },
    { 'title': '사공이 많으면 배가 산으로 올라간다.', 'ex': '무슨 일을 할 때 간섭하는 사람이 많으면 일이 잘 안 된다.' },
    { 'title': '사나운 개 콧등 아물 때가 없다.', 'ex': '남과 싸우기를 좋아하는 사람은 언제나 자기에게도 손해가 따름' },
    { 'title': '사람과 쪽박은 있는 대로 쓴다.', 'ex': '사람은 제각기 쓸모 있다.' },
    { 'title': '사자 어금니 같다.', 'ex': '사자의 어금니는 가장 요긴한 것이니 반드시 있어야만 하는 것을 말함.' },
    { 'title': '사주팔자에 없는 관을 쓰면 이마가 벗어진다.', 'ex': '제 분수에 넘치는 일을 하게 되면 도리어 괴롭다.' },
    { 'title': '산 개가 죽은 정승보다 낫다.', 'ex': '아무리 구차하고 천한 신세라도 죽는 것보다는 사는 것이 낫다.' },
    { 'title': '산 밑 집에 방앗공이가 논다.', 'ex': '그 고장 산물이 오히려 그 곳에서 희귀하다.' },
    {
        'title': '산은 오를수록 높고 물은 건널수록 깊다.',
        'ex': '어려운 고비를 당하여 갈수록 점점 더 어렵고 곤란한 일만 생긴다.'
    },
    { 'title': '산이 높아야 골이 깊다.', 'ex': '원인이나 조건이 갖추어져야 일이 이루어진다.' },
    { 'title': '산 호랑이 눈썹.', 'ex': '도저히 얻을 수 없는 것을 얻으려 하는 것.' },
    {
        'title': '살 강 밑에서 숟가락 줍는다.',
        'ex': '횡재한 것 같으나 사실은 물건 임자가 분명한 즉 헛 좋았다. 아주 쉬운 일을 하고 자랑한다.'
    },
    {
        'title': '삼 년 먹여 기른 개가 주인 발등 문다.',
        'ex': '오랫동안 은혜를 입은 사람이 도리어 그 은인은 해치며 비웃는다.'
    },
    {
        'title': '상시에 먹은 맘이 취중에 난다.',
        'ex': '누구나 술에 취하게 되면 평소에 가졌던 생각이 언행에 나타남. (취중에 진담이 나온다.)'
    },
    {
        'title': '상전 배부르면 종 배고픈 줄 모른다.',
        'ex': '남의 사정은 조금도 알아 주지 않고 저만 위할 줄 알고 제 욕심만 채우려는 사람.'
    },
    { 'title': '새도 날려면 움츠린다.', 'ex': '어떤 일이든지 사전에 만반의 준비가 있어야 한다는 뜻에서 나온 말.' },
    { 'title': '새 옷도 두드리면 먼지난다.', 'ex': '아무리 청백한 사람이라도 속속들이 파헤쳐 보면 부정이 드러난다.' },
    { 'title': '새침 떼기 골로 빠진다.', 'ex': '얌전한 사람일수록 한 번 길을 잘못 들면 걷잡을 수 없다.' },
    { 'title': '생나무에 좀이 날까.', 'ex': '건실하고 튼튼하면 내부가 부패되지 않음.' },
    { 'title': '생감도 떨어지고 익은 감도 떨어진다.', 'ex': '늙은 사람만 죽는 것이 아니라 젊은 사람도 죽는다.' },
    { 'title': '서리 맞은 구렁이.', 'ex': '행동이 몹시 느리고 하는 일에 힘이 없음.' },
    { 'title': '서울이 무섭다니까 과천서부터 긴다.', 'ex': '어떤 일을 당하기도 전에 말로만 듣고 미리부터 겁낸다.' },
    { 'title': '서투른 무당 장구만 나무란다.', 'ex': '능력이 부족한 것도 모르고 도구만 나쁘다고 탓함.' },
    { 'title': '섣달 그믐날 개밥 퍼주듯 한다.', 'ex': '남에게 음식을 후하게 줌.' },
    { 'title': '소가 크다고 왕 노릇 할까.', 'ex': '지혜가 없이 힘만 가지고서는 지도자 위치에 나설 수 없다.' },
    { 'title': '소경이 개천 탓한다.', 'ex': '자기 잘못은 조금도 생각지 못하고 남의 잘못을 원망함.' },
    { 'title': '소매 긴 김에 춤춘다.', 'ex': '생각이 없던 일이라도 그 일을 할 조건이 갖추어졌기 때문에 하게 됨.' },
    { 'title': '속곳 벗고 은가락지 낀다.', 'ex': '격에 맞지 않는 겉치레를 하여 도리어 보기 흉하다.' },
    { 'title': '속 빈 강정이다.', 'ex': '속이 텅 비어 아무 실속이 없다.' },
    { 'title': '손도 안 대고 코풀려고 한다.', 'ex': '수고는 조금도 하지 않고 큰 소득만 얻으려고 한다.' },
    { 'title': '손자 턱에 흰 수염 나겠다.', 'ex': '오랜 시간을 기다리기가 지루함.' },
    { 'title': '송충이가 갈잎을 먹으면 떨어진다.', 'ex': '제 직분에 맞지 않는 딴 생각을 하다가는 실패를 한다.' },
    { 'title': '소똥에 미끄러져 개똥에 코방아 찧는다.', 'ex': '연거푸 실수하여 어이가 없다.' },
    { 'title': '쇠 털 뽑아 제 구멍에 박는다.', 'ex': '고지식하여 조금도 융통성이 없다.' },
    { 'title': '수박 먹다 이 빠진다.', 'ex': '운이 나쁘면 대단치 않은 일을 하다가도 큰 해를 당한다.' },
    { 'title': '숭어가 뛰니까 망둥이도 뛴다.', 'ex': '제 처지는 생각하지 않고 저보다 나은 사람을 모방하려고 애씀.' },
    { 'title': '숯이 검정 나무란다.', 'ex': '자기 흠이 더 큰 사람이 도리어 흠이 적은 사람을 흉본다.' },
    { 'title': '시루에 물 퍼 붓기.', 'ex': '아무리 비용을 들이고 애를 써도 효과가 나타나지 않음.' },
    { 'title': '시원찮은 귀신이 사람 잡는다.', 'ex': '얼른 보아 미련하고 못나 보이는 자가 도리어 큰 사건을 일으킨다.' },
    { 'title': '신 신고 발바닥 긁기.', 'ex': '일하기는 해도 시원치 않다.' },
    { 'title': '실없는 말이 송사 건다.', 'ex': '무심히 한 말 때문에 큰 변이 생김.' },
    { 'title': '십 년 과부도 시집갈 마음은 못 버린다.', 'ex': '뼈에 사무치게 아픈 마음은 잊어버리기가 어렵다.' },
    { 'title': '십 년 세도 없고 열흘 붉은 꽃 없다.', 'ex': '부귀영화는 오래 계속 되지 못한다.' },
    { 'title': '쌀독에 앉은 쥐.', 'ex': '부족함이 없고 만족한 처지를 말함.' },
    {
        'title': '아갈잡이를 시켰다.',
        'ex': '하기 싫어하는 것을 강제로 억눌러 시켰기 때문에 행동이 자연스럽지 못하고 경직된 자세로 함.'
    },
    { 'title': '아랫돌 빼어 웃돌 괴기.', 'ex': '임시변통으로 한 곳에서 빼어 다른 곳을 막는다.' },
    { 'title': '아무리 바빠도 바늘허리 매어 못 쓴다.', 'ex': '아무리 바쁜 일이라도 일정한 순서를 밟아서 하여야 한다.' },
    {
        'title': '아직 이도 나기 전에 갈비 뜯는다.',
        'ex': '자신의 실력도 제대로 모르면서 턱도 없이 힘에 겨운 짓을 하려고 덤벼든다.'
    },
    {
        'title': '안방에 가면 시어머니 말이 옳고 부엌에 가면 며느리 말이 옳다.',
        'ex': '각각 일리가 있어 그 시비를 가리기 어렵다.'
    },
    {
        'title': '양반은 물에 빠져도 개헤엄은 안한다.',
        'ex': '아무리 위급한 때라도 점잖은 사람은 체면 깎이는 일을 하지 않는다.'
    },
    {
        'title': '양반은 얼어 죽어도 짚불은 안 쬔다.',
        'ex': '아무리 위급한 때라도 점잖은 사람은 체면 깎이는 일을 하지 않는다.'
    },
    { 'title': '얕은 내도 깊게 건너라.', 'ex': '모든 일을 언제나 조심성 있게 해야 함.' },
    { 'title': '돌다리도 두드려 보고 건너라.', 'ex': '모든 일을 언제나 조심성 있게 해야 함.' },
    { 'title': '어느 구름에서 비가 올지.', 'ex': '미리 짐작하기 어렵다.' },
    {
        'title': '언 발에 오줌 누기.',
        'ex': '눈앞에 급한 일을 피하기 위해서 하는 임시변통이 결과적으로 더 나쁘게 되었을 때 하는 말.'
    },
    { 'title': '얻은 떡이 두레 반이다.', 'ex': '여기저기서 조금씩 얻은 것이 남이 애써 만든 것보다 많다.' },
    { 'title': '영리한 고양이가 밤 눈 못 본다.', 'ex': '똑똑한 체하는 사람이 흔히 못난 짓을 함.' },
    { 'title': '오뉴월 하루 볕이 무섭다.', 'ex': '오뉴월은 해가 길기 때문에 잠깐 동안이라도 자라는 정도의 차이가 크다.' },
    { 'title': '오리(五里) 보고 십리 간다.', 'ex': '적은 일이라도 유익한 것이면 수고를 아끼지 아니해야 한다.' },
    { 'title': '오소리감투가 둘이다.', 'ex': '한 가지 일에 책임질 사람은 두 명이 있어서 서로 다툰다.' },
    {
        'title': '욕심 많은 놈이 참외 버리고 호박 고른다.',
        'ex': '무슨 일에는 욕심을 너무 부리다가 도리어 자신이 손해를 보게 됨.'
    },
    { 'title': '울며 겨자 먹기.', 'ex': '싫은 일을 억지로 함.' },
    { 'title': '윷짝 가르듯 한다.', 'ex': '윷짝의 앞뒤가 분명하듯이 무슨 일에 대한 판단을 분명히 한다.' },
    {
        'title': '은행나무도 마주봐야 연다.',
        'ex': '은행나무도 마주 보아야 열매를 맺듯이 남녀도 서로 결합해야 집안이 번영한다.'
    },
    { 'title': '입이 여럿이면 무쇠도 녹인다.', 'ex': '여러 사람이 의견의 일치를 보면 무슨 일이라도 할 수 있다.' },
    {
        'title': '자는 범 침주기.',
        'ex': '그대로 가만 두었으면 아무 일도 없었을 것을 공연히 건드려서 일을 저질러 위태롭게 된다.'
    },
    { 'title': '자다가 봉창 두드린다.', 'ex': '되지도 않은 딴 소리를 불쑥 함.' },
    { 'title': '자라 알 지켜보듯 한다.', 'ex': '어떻게 일을 처리하려고 노력하지는 않고 그저 묵묵히 들여다보고만 있다.' },
    {
        'title': '자루 속 송곳은 빠져 나오게 마련이다.',
        'ex': '남들이 알지 못하도록 아무리 은폐하려 해도 탄로 날 것은 저절로 탄로가 난다.'
    },
    {
        'title': '잔소리 많은 집안은 가난하다.',
        'ex': '잔소리가 많으면 가정이 늘 화목하지 못하고, 화목하지 못하면 가난을 벗어날 수 없다.'
    },
    { 'title': '잔칫날 잘 먹으려고 사흘 굶을까?', 'ex': '훗날에 있을 일만 믿고 막연히 기다리겠느냐.' },
    {
        'title': '잘 집 많은 나그네가 저녁 굶는다.',
        'ex': '일을 너무 어지럽게 여러 가지로 벌여 놓기만 하면 결국에는 실패하게 된다.'
    },
    { 'title': '잠결에 남의 다리 긁는다.', 'ex': '자기를 위하며 한 일이 뜻밖에 남을 위한 일이 되어 버림.' },
    { 'title': '장구를 쳐야 춤을 추지.', 'ex': '거들어 주는 사람이 있어야 일을 할 수 있다.' },
    { 'title': '장님 제 닭 잡아먹기.', 'ex': '남을 해하려다 해가 제게로 돌아옴.' },
    { 'title': '장대로 하늘 재기.', 'ex': '가능성이 없는 짓.' },
    { 'title': '적게 먹고 가는 똥 눈다.', 'ex': '분수대로 살라.' },
    { 'title': '절룩말이 천리 간다.', 'ex': '약한 사람이라도 꾸준하게 열심히 노력해 나가면 무슨 일이라도 할 수 있다.' },
    { 'title': '절에 가면 중노릇하고 싶다.', 'ex': '일정한 주견이 없이 덮어놓고 남을 따르려 한다.' },
    { 'title': '절에 가서 젓국 달라 한다.', 'ex': '당치 않은 곳에 가서 엉뚱한 짓을 한다.' },
    { 'title': '접시 밥도 담을 탓이다.', 'ex': '수단이나 성의를 다하면 어려운 일이라도 좋은 성과를 이룰 수 있다.' },
    { 'title': '제 논에 물 대기.', 'ex': '자기의 이익만 생각한다.' },
    { 'title': '제비는 작아도 강남을 간다.', 'ex': '사람이나 짐승이 모양은 작아도 제 할 일은 다 한다.' },
    { 'title': '제 얼굴 못 나서 거울 깬다.', 'ex': '제 잘못은 모르고 남만 나무람.' },
    { 'title': '제 털 뽑아 제 구멍에 막기.', 'ex': '성미가 너무 고지식하여 융통성이 없다.' },
    { 'title': '제 팔자 개 못 준다.', 'ex': '타고난 운명은 버릴 수 없다.' },
    {
        'title': '종로에서 뺨 맞고 한강에 가서 눈 흘긴다.',
        'ex': '욕을 당한 그 자리에서는 아무 말도 못하고 화풀이를 딴 곳에 가서 함.'
    },
    {
        'title': '주린 개 뒷간 넘겨다보듯 한다.',
        'ex': '누구나 배가 몹시 고플 때는 무엇이고 먹을 것을 찾기 위해 여기저기를 기웃거림.'
    },
    { 'title': '주먹구구에 박 터진다.', 'ex': '무슨 일을 어림짐작으로 그저 대충 하다가는 크게 낭패를 당하게 됨.' },
    { 'title': '죽 쑤어서 개 좋은 일.', 'ex': '애써서 이루어 놓은 일이 남에게 유리할 뿐이다.' },
    { 'title': '죽은 나무에 꽃이 핀다.', 'ex': '별것 없던 집안에서 영화로운 일이 있을 때.' },
    {
        'title': '죽 푸다 흘려도 솥 안에 떨어진다.',
        'ex': '일이 제대로 안되어 막상 손해를 본 것 같지만 따지고 보면 결코 손해는 없다.'
    },
    { 'title': '중은 중이라도 절 모르는 중이라.', 'ex': '반드시 알아야 할 처지에 있으면서 모르고 있다.' },
    { 'title': '중이 제 머리를 못 깎는다.', 'ex': '아무리 중요한 일이라도 자기 문제를 스스로 해결할 수 없다.' },
    { 'title': '쥐구멍에 홍살문.', 'ex': '마땅치 않은 일을 주책없이 하려 함.' },
    {
        'title': '지척이 천리다.',
        'ex': '서로 가까이 있으면서도 오랫동안 모르고 왕래가 없어서 멀리 떨어져 사는 것이나 마찬가지.'
    },
    { 'title': '집도 절도 없다.', 'ex': '가진 집이나 재산이 없고 여기저기 떠돎.' },
    {
        'title': '집에서 새는 바가지는 들에 가도 샌다.',
        'ex': '타고난 천성이 나쁜 사람은 어디를 가나 그 성품을 고치기 어렵다.'
    },
    { 'title': '쪽박 빌려주니 쌀 꿔 달란다.', 'ex': '편의를 봐 부면 봐 줄수록 더 요구함.' },
    { 'title': '쪽박 쓰고 벼락 피한다.', 'ex': '아무리 애를 써도 피할 수 없음을 두고 비유한 말.' },
    { 'title': '차(車)치고, 포(包)친다.', 'ex': '무슨 일을 아주 시원스럽게 해 치움.' },
    {
        'title': '참깨 들깨 노는데 아주까리가 못 놀까?',
        'ex': '남들이 다하는 일을 나라고 못 하겠느냐 하고 한 몫 끼자고 나설 때.'
    },
    { 'title': '참새가 죽어도 짹 한다.', 'ex': '아무리 약한 사람이라도 너무 괴롭히면 대항한다.' },
    { 'title': '참새가 허수아비 무서워 나락 못 먹을까?', 'ex': '반드시 큰일을 하려면 다소의 위험정도는 감수해야 한다.' },
    { 'title': '참외 장수는 사촌이 지나가도 못 본 척한다.', 'ex': '장사하는 사람은 인색하다.' },
    {
        'title': '처갓집에 송곳 차고 간다.',
        'ex': '처갓집 밥은 꼭꼭 눌러 담았기 때문에 송곳으로 파야 먹을 수 있다는 말로 처갓집에서는 사위대접을 극진히 한다.'
    },
    { 'title': '처삼촌 묘 벌초하듯.', 'ex': '일에 정성을 드리지 않고 건성건성 해치워 버리는 것.' },
    { 'title': '천둥에 개 놀라듯 한다.', 'ex': '몹시도 놀라서 허둥대며 정신을 못 차리고 날뛴다.' },
    {
        'title': '천리마는 늙었어도 천리 가던 생각만 한다.',
        'ex': '몸은 비록 늙었어도 마음은 언제나 젊은 시절과 다름없다.'
    },
    {
        'title': '천만 재산이 서투른 기술만 못하다.',
        'ex': '자기가 지닌 돈은 있다가도 없어질 수 있지만 한번 배운 기술은 죽을 때까지 지니고 있기 때문에 생활의 안정을 기할 수 있다.'
    },
    {
        'title': '첫날밤에 지게 지고 들어가도 제 멋이다.',
        'ex': '제가 좋아서 하는 일은 남이 어떻게 보든지 전혀 상관이 없다.'
    },
    {
        'title': '청대콩이 여물어야 여물었나 한다.',
        'ex': '청대콩은 다 여물어도 여문 것인지 안 여문 것인지 눈으로 보아서는 잘 모르듯이 모든 일을 겉으로만 봐서는 잘 파악할 수 없다.'
    },
    { 'title': '초록은 동색이다.', 'ex': '끼리끼리 모인다는 뜻.' },
    { 'title': '초상술에 권주가 부른다.', 'ex': '때와 장소를 분별하지 못함.' },
    { 'title': '촌닭 관청에 잡혀 온 격.', 'ex': '경험 없는 일을 당하여 어리둥절함.' },
    {
        'title': '칠 년 가뭄에 하루 쓸 날 없다.',
        'ex': '오랫동안 날씨가 개고 좋다가도 모처럼 무슨 일을 하려고 하면 비가 옴.'
    },
    { 'title': '칼도 날이 서야 쓴다.', 'ex': '자기에게 주어진 역할을 제대로 하려면 그만한 실력이 있어야 한다.' },
    { 'title': '코가 댓 자나 빠졌다.', 'ex': '근심 걱정이 많아 맥이 확 빠졌다.' },
    {
        'title': '코딱지 둔다고 살이 될까.',
        'ex': '이미 잘못된 것을 그대로 둔다고 하더라도 다시 원상태로 바로 잡을 수 없다.'
    },
    { 'title': '콩 볶아 먹다가 가마솥 터뜨린다.', 'ex': '작은 이익을 탐내다가 도리어 큰 해를 입는다.' },
    { 'title': '콩이야 팥이야 한다.', 'ex': '별 차이 없는 것을 가지고 다르다고 따지거나 시비한다.' },
    { 'title': '큰 방축도 개미구멍으로 무너진다.', 'ex': '작은 사물이라도 업신여기다가는 그 때문에 큰 화를 입는다.' },
    { 'title': '큰북에서 큰 소리 난다.', 'ex': '도량이 커야 훌륭한 일을 한다.' },
    { 'title': '터를 잡아야 집도 짓는다.', 'ex': '모든 일에는 기반과 순서가 있어야 된다.' },
    { 'title': '터진 꽈리 보듯.', 'ex': '터져서 쓸데없는 꽈리를 보듯이 어느 누구도 탐탁지 않게 여기고 중요시하지 않음.' },
    { 'title': '털도 안 난 것이 날기부터 하려 한다.', 'ex': '못난 사람이 제격에 맞지 않는 엄청난 짓을 한다는 것.' },
    {
        'title': '토끼를 다 잡으면 사냥개를 삶는다.',
        'ex': '필요할 때는 소중히 여기다가도 필요 없게 되면 천대하고 버림받음.'
    },
    { 'title': '티끌 모아 태산.', 'ex': '적은 것도 거듭 쌓이면 많아짐.' },
    { 'title': '파리똥도 똥이다.', 'ex': '양적으로는 비록 적을지라도 본질적으로는 전혀 다를 바가 없다.' },
    {
        'title': '팔이 들이굽지 내 굽나.',
        'ex': '친밀한 사이에 있는 사람에게 먼저 동정하게 되며 자기에게 유리하도록 꾀하는 것.'
    },
    {
        'title': '평택이 무너지나 아산이 깨어지나.',
        'ex': '끝까지 경쟁을 해 봄.(평택과 아산은 청일전쟁 때 싸움을 한 곳)'
    },
    { 'title': '포도청 문고리도 빼겠다.', 'ex': '겁이 없고 대담한 사람.' },
    {
        'title': '풀 방구리에 쥐 드나들 듯 한다.',
        'ex': '풀을 담아 놓은 그릇의 풀을 먹으려고 드나드는 쥐처럼 자주 드나드는 모양.'
    },
    { 'title': '하늘 높은 줄은 모르고 땅 넓은 줄만 안다.', 'ex': '키가 작고 옆으로만 퍼져 뚱뚱하게 생긴 사람.' },
    { 'title': '하늘 보고 주먹질한다.', 'ex': '아무 소용없는 일을 한다.' },
    {
        'title': '하늘 보고 침 뱉기.',
        'ex': '하늘에다 대고 침을 뱉으면 결국 자기 얼굴에 떨어지듯이 남을 해치려다가 자기가 당한다.'
    },
    { 'title': '하늘을 보아야 별도 딴다.', 'ex': '노력과 준비가 있어야 보람을 얻음.' },
    { 'title': '하늘을 쓰고 도리질한다.', 'ex': '세상이 무서운 줄을 모르고 마구 권력을 휘두른다.' },
    { 'title': '하룻강아지 범 무서운 줄 모른다.', 'ex': '철모르고 아무에게나 함부로 힘을 쓰면서 덤비는 사람.' },
    { 'title': '학도 아니고 봉도 아니고 아무것도 아니라.', 'ex': '행동이 뚜렷하지 않거나 사람이 분명치 않음.' },
    { 'title': '한강에 돌 던지기.', 'ex': '지나치게 작아 전혀 효과가 없다.' },
    {
        'title': '한날한시에 난 손가락도 길고 짧다.',
        'ex': '형제간에도 슬기로운 사람과 어리석은 사람이 생기며 같은 등속이라도 고르지 못함.'
    },
    { 'title': '한 다리가 천리(千里)다.', 'ex': '촌수가 가까울수록 정에 더 이끌린다.' },
    {
        'title': '한 달이 크면 한 달이 작다.',
        'ex': '세상일이란 한 번 좋은 일이 있으면 한 번은 나쁜 일이 있게 마련이다.'
    },
    { 'title': '한솥밥 먹고 송사한다.', 'ex': '가까운 사람끼리 다툰다.' },
    {
        'title': '한 술 밥에 배부르랴?',
        'ex': '무슨 일이나 처음에는 자기가 기대한 만큼의 성과를 얻을 수 없다. 한 어미 자식도 아롱이 다롱이가 있다. 세상 일이 다 같을 수는 없다.'
    },
    {
        'title': '함박 시키면 바가지 시키고, 바가지 시키면 쪽박 시킨다.',
        'ex': '어떤 일을 윗사람이 아랫사람에게 시키면 그는 또 제 아랫사람에게 다시 시킨다.'
    },
    { 'title': '항우도 댕댕이 덩굴에 넘어진다.', 'ex': '아무리 작은 일도 무시하면 실패하기 쉽다.' },
    {
        'title': '행랑 빌면 안방까지 든다.',
        'ex': '처음에는 소심하게 발을 들여놓다가 재미를 붙이면 대담해져 정도가 심한 일까지 함.'
    },
    { 'title': '허허 해도 빚이 열 닷 냥이다.', 'ex': '겉으로는 호기 있게 보이나 속으로는 근심이 가득하다.' },
    { 'title': '호랑이에게 개 꾸어 주기.', 'ex': '빌려주면 다시 받을 가망이 없음.' },
    {
        'title': '호랑이에게 물려가도 정신만 차리면 산다.',
        'ex': '아무리 위급한 일을 당하여도 정신만 똑똑히 차리면 위기를 면할 수 있다.'
    },
    { 'title': '호미로 막을 것을 가래로 막는다.', 'ex': '적은 힘으로 될 일을 기회를 놓쳐 큰 힘을 들이게 된다.' },
    { 'title': '호박씨 까서 한 입에 넣는다.', 'ex': '조금씩 저축하였다가 그것을 한꺼번에 소비해 버림을 말함.' },
    { 'title': '호박꽃도 꽃이라니까 오는 나비 괄시한다.', 'ex': '못생긴 여자에게 구애를 하였다가 오히려 거절을 당함.' },
    { 'title': '호박에 침주기.', 'ex': '아무 반응이 없다.' },
    {
        'title': '홀아비 사정은 과부가 알아준다.',
        'ex': '남이 어려운 사정은 서로 비슷한 환경에 있는 사람이라야 헤아릴 수 있다.'
    },
    { 'title': '화약을 지고 불에 들어간다.', 'ex': '자기 스스로 위험한 곳에 들어감.' },
    {
        'title': '황금 천 냥이 자식 교육만 못 하다.',
        'ex': '막대한 유산을 남겨 주는 것 보다는 자녀 교육이 더 중요한 것.'
    },
    { 'title': '황소 뒷걸음치다가 쥐 잡는다.', 'ex': '어리석은 사람이 미련한 행동을 하다가 뜻밖에 좋은 성과를 얻음.' },
    { 'title': '흘러가는 물도 떠 주면 공이 된다.', 'ex': '쉬운 일이라도 도와주면 은혜가 된다.' },
    {
        'title': '흥정은 붙이고 싸움은 말리랬다.',
        'ex': '좋은 일은 될 수 있는 한 권장하고, 나쁜 일은 뜯어 말려야 한다.'
    },
    { 'title': '흰 죽에 코다.', 'ex': '좋은 것인지 나쁜 것인지 전혀 구별할 수 없게 되었음.' }]
}

/*
url quers의 id가
0 -> datas[0] == 1학기 중간고사 국어 어휘
1 -> datas[1] == 1학기 중간고사 국어 한자 성어

추가 예정
2 -> datas[2] == 1학기 기말고사 국어 어휘
3 -> datas[3] == 1학기 기말고사 국어 한자 성어
*/

function get_quers(){
    urls = location.search.split("&")
    quers = {}


    for(var i = 0; i < urls.length; i++){
        url_data = urls[i].split("=") 
        if (i == 0){
            quers[url_data[0].slice(1)] = url_data[1]
        }   else{
            quers[url_data[0]] = url_data[1]
        }
        // console.log(urls[i])
    }
    return quers

    // real = data[quers["id"]]

    // for(var i = 0; i < real.length; i++){
    //     console.log(real[i])
    // }
}

id = Number(get_quers()["id"])
// alert(id)
if ((window.location.href).indexOf("index.html") === -1){
    if(isNaN(id) || id < 0 || id > 4){
        location.href = "/index.html"
    }
}